[
  {
	"event": [
	  { "action": "set_background", "target": "north_gate_battlefield" },
	  { "action": "unlock","target": "3_11_1" },
	  { "action": "show_name", "target": "Player" }
	],
	"text": "The instant I break from the shield line, the world twists into wind and snow. The rim of a shield scrapes my shoulder, iron grinding against ice with a shrill scream."
  },

  { "text": "The snow beneath my boots softens under the Demon King’s ‘breath,’ as if it might collapse into a pit at any second. I nearly trip over a slab of broken stone—but force that step steady." },
  { "text": "I’m not running to kill it. I’m here to steal back half a second from between the black mist’s teeth." },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "I swallow air into my lungs—swallow the fear with it. Then I hurl my voice forward—harder than the wind."
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“Alicia—! No matter how many times it takes, I’ll wait for you!”"
  },

  { "text": "The wind tears at the words—but they don’t break. They stretch like a taut line, catching at her heart." },
  { "text": "Her trembling fingers steady at once." },
  { "text": "Even the Demon King’s mist falters for a fraction of a second—like it has noticed a ‘variable’ in the loop." },

  {
	"event": [
	  { "action": "show_name", "target": "Mowang" },
	  { "action": "shake", "target": "Mowang" }
	],
	"text": "The Demon King tilts its head—not in rage, but in confusion."
  },

  { "text": "The mist coiled around her wrist loosens by a thread." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“…Don’t run around.”"
  },

  { "text": "She doesn’t look back. The words are both command and protection." },
  { "text": "She moves along that narrow opening—not faster, just more precise." },

  {
	"event": [{ "action": "shake", "target": "Alicia" }],
	"text": "She flips her wrist and draws out the necklace. The pendant burns in the black light, but she grips it without hesitation."
  },

  { "text": "The mist tries to recoil—but the Demon King’s focus lingers on me, half a beat too slow." },
  { "text": "Half a beat is the distance between life and death." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“End.”"
  },

  {
	"event": [{ "action": "shake", "target": "Alicia" }],
	"text": "She slams the necklace into the core’s fracture. The moment it sinks in, blazing white veins erupt outward from within."
  },

  { "text": "The Demon King howls, distorted and tearing. Its bone armor cracks apart, fractures climbing toward the sky." },
  { "text": "She pulls her sword free and steps back—then takes one step toward me, as if finally allowing herself to admit she is not alone." },

  { "text": "But the core collapses behind her." },

  {
	"event": [
	  { "action": "shake", "target": "Alicia" },
	  { "action": "shake", "target": "Player" }
	],
	"text": "The shockwave explodes outward. Snow and shattered stone rise in a white tidal surge. The city walls tremble. She is thrown toward me."
  },

  { "text": "In midair, she twists, turning her back to the blast—shielding me from the worst of it." },

  {
	"event": [{ "action": "shake", "target": "Alicia" }],
	"text": "She crashes down beside me, shoulder armor shattered. Her breath stutters—yet her hand still reaches to make sure I’m here."
  },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“You did it…”"
  },

  { "text": "At the blast’s center, the Demon King’s form disintegrates. The black mist falls away like torn curtains, fragment by fragment." },

  {
	"event": [{ "action": "remove_character", "target": "Mowang" }],
	"text": "At last, the Demon King vanishes completely. The rift stitches itself closed, and the sky’s strange light slowly fades."
  },

  { "text": "The wind stops." },
  { "text": "And the suffocating sense of countdown pressing on the world—stops with it." },

  {
	"event": [{ "action": "change_scene", "target": "scene3.12" }]
  }
]
