[
  {
	"event": [
	  { "action": "hide_talk_ui" },
	  { "action": "set_background", "target": "tavern_night" },
	  { "action": "unlock", "target": "3_4" },
	  { "action": "spawn_character", "target": "Alicia", "pos": [-250, 0] },
	  { "action": "show_talk_ui" }
	],
	"text": "The candle has burned shorter, wax slowly trailing down its side. The soup on the table has long gone lukewarm. All that lingers in the air now is its fading scent—and the weight of the words she just spoke."
  },

  { "text": "Alicia’s breathing is uneven. She tries to keep her back straight, but her shoulders gradually sink, like a string pulled too tight finally loosening." },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“Are you okay?”"
  },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“No.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“I’m tired.”"
  },

  { "text": "She says it too plainly—like she’s finally too exhausted to pretend. Those eyes that always burned too brightly suddenly redden, like smoke has drifted into the firelight." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“I’m not afraid of dying.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“I’m afraid that every time I come back, I have to piece myself together again.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“And one day, I’ll be nothing but fragments that know how to swing a sword.”"
  },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“You’re not fragments.”"
  },

  { "text": "It’s like the words strike her. Her lips tremble—she tries to smile, but can’t. The tears fall instead. Not sobbing. Just silent and fast." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Don’t say that.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“If you say that, I’ll want to keep going.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“But I really… can’t anymore.”"
  },

  { "text": "She wipes at her eyes clumsily. The motion looks unlike her. Like that single gesture costs her the last of her strength." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“I just… want to sleep for a while.”"
  },

  { "text": "She lowers her forehead to the table edge, tentative at first. Then her whole body slowly leans forward. She’s still clutching the napkin midair, like if she lets go, the world might fall apart." },
  { "text": "Candlelight flickers over the folds of her red dress. Her lashes are wet, but soon they stop trembling. She falls asleep—light and heavy at the same time, like someone pulled under deep water." },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "I look at her, and for a moment I don’t know whether to see her as a warrior, a guest, or someone on the verge of breaking."
  },

  {
	"event": [
	  {
		"action": "show_option_ui",
		"options": [
		  {
			"text": "Option A: Carry her upstairs so she can sleep properly (you will move carefully, without waking her)【Strength Check (DC 10)】",
			"dc": 10,
			"check": "strength"
		  },
		  {
			"text": "Option B: Let her sleep at the table (you stay beside her, shielding her from wind and candlelight)【No Check (DC 0)】",
			"dc": 0,
			"check": "dexterity"
		  }
		]
	  },
	  { "action": "hide_talk_ui" }
	]
  }
]
