[
  {
	"event": [
	  { "action": "set_background", "target": "tavern_night" },
	  { "action": "show_talk_ui" }
	],
	"text": "[3.2 | Candlelight Dinner: Red Dress and Good Food]"
  },
  {
	"text": "Night falls quickly, and the snow buries the sounds of the street."
  },
  {
	"text": "I hang the “Closed” sign earlier than usual. The dull thud of the bolt sliding into place sounds like sealing the entire town outside."
  },
  {
	"text": "Then I return to the kitchen—driven by some unreasonable impulse—and start cooking."
  },
  {
	"text": "A pot of stew simmers over low heat, its aroma slowly filling the hallway. The crust of the bread cracks in the oven, oil and salt rising into the air. I slice cured meat and cheese, and wipe down the last bottle of wine that isn’t too sour, placing it at the center of the table."
  },
  {
	"text": "I tell myself: it’s just a meal. Just… a way to make tonight less terrible than usual."
  },
  {
	"text": "Footsteps sound on the stairs."
  },
  {
	"text": "First step. Second step. Third step—she pauses."
  },
  {
	"text": "My heart feels like someone has lightly plucked it with a fingertip. I haven’t looked up, yet I already know she’s coming down."
  },
  {
	"event": [
	  { "action": "spawn_character", "target": "Alicia", "pos": [-450, 0] },
	  { "action": "show_name", "target": "Alicia" }
	],
	"text": "Alicia steps into the firelight."
  },
  {
	"text": "She wears no cloak. No armor."
  },
  {
	"text": "A long red dress falls against her figure, cutting a line through the night that’s almost too bright. The red is too vivid, too clean—like a flower blooming in the snow. Beautiful, unreasonable, out of place."
  },
  {
	"text": "Her silver hair is loosely pinned up, a few strands falling along her neck. In the firelight, they gleam like scattered blades."
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“You…”"
  },
  {
	"text": "I meant to say, “Why are you dressed like that?” But the words catch in my throat, like I’m afraid of breaking something."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Do I look good?”"
  },
  {
	"text": "She asks softly—half testing, half commanding."
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“…You’re very conspicuous.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“That’s the point.”"
  },
  {
	"text": "She walks to the table, her fingertips brushing the edge of the tablecloth, as if confirming this isn’t an illusion."
  },
  {
	"text": "Then she notices the spread of food. Her gaze goes briefly blank—not shock, but something like being struck by hesitation."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“You really did it.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“I said I would.”"
  },
  {
	"text": "I ladle the stew and place it in front of her. Steam rises, softening her face for a moment."
  },
  {
	"text": "She sits very straight, steady, like she could draw an invisible sword from the chair at any moment."
  },
  {
	"text": "But her fingers lightly rub the edge of the table, as if holding back an unnecessary tremor."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“You closed the tavern.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“Yeah. No customers tonight.”"
  },
  {
	"text": "I pour the wine. The liquid taps softly against the glass."
  },
  {
	"text": "She watches the cup, and suddenly her expression twists into something that’s almost a smile, but not quite."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Did you know? Every time you pour wine, you spill just a little.”"
  },
  {
	"text": "My hand jerks. A drop spills over."
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“…Not every time.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Yes. Every time.”"
  },
  {
	"text": "She says it with absolute certainty, like she’s stating a pattern already proven by data."
  },
  {
	"text": "I wipe the rim of the glass and deliberately avoid her eyes."
  },
  {
	"text": "We start eating."
  },
  {
	"text": "The stew is hot. The bread smells good. The cured meat is a bit salty. Normal—too normal for a dinner that shouldn’t exist in a story like this."
  },
  {
	"text": "But whenever the fire pops, her gaze flickers. Whenever the wind outside grows louder, her fingertip taps the table once, like she’s counting."
  },
  {
	"text": "I try to talk about light things: the baker in town, the child selling flowers by the fountain, the snow these past few days."
  },
  {
	"text": "She responds—more than she did during the day—as if she’s suddenly decided to pry some long-held silence apart by force."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“I never used to wear red.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“Why not?”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Because red looks like blood.”"
  },
  {
	"text": "Then she adds, her tone light enough to sound like a lie:"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“But tonight, I want you to remember me.”"
  },
  {
	"text": "My chopsticks freeze halfway. My throat goes dry."
  },
  {
	"text": "She takes a sip of wine, her eyes drifting instead to the fading bruise on the back of my hand."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Does it hurt?”"
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“Not anymore.”"
  },
  {
	"text": "She studies me, like she’s calculating the probability that I’m lying."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“I’ll remove everything that hurts you.”"
  },
  {
	"text": "The statement is too direct—direct enough to make my spine go cold."
  },
  {
	"text": "But after saying it, she lowers her head and drinks her soup, as if she were just commenting on the weather."
  },
  {
	"text": "The meal slowly draws to an end."
  },
  {
	"text": "Firelight throws the shadow of her red dress onto the wall. The shadow is bolder than she is, like a banner."
  },
  {
	"text": "I suddenly realize: she didn’t come here for a “date.” She’s using this meal to drag some ending forward—pulling it into a rhythm she can control."
  },
  {
	"text": "And me—I actually cooked a good meal, closed the tavern early, and locked myself into her rhythm with her."
  },
  {
	"text": "She sets her cup down and taps the glass once with her fingertip."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“We’re done eating.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Now it’s your turn to listen.”"
  },
  {
	"text": "She looks up. Her gray-blue eyes shine too brightly in the firelight, like she’s about to pin me in place."
  },
  {
	"event": [
	  { "action": "change_scene", "target": "scene3.3" }
	]
  }
]
