[
  {
	"event": [
	  { "action": "set_background", "target": "north_gate_battlefield" },
	  { "action": "unlock","target": "3_11" },
	  { "action": "show_talk_ui" }
	],
	"text": "The sky beyond the North Gate looks as though it has been poured over with molten iron—heavy and black. Wind drives snow against armor in sharp, scraping bursts."
  },

  { "text": "The barrier is reduced to a thin layer of blue light, like dying skin clinging to the outer wall, flickering between bright and dim." },
  { "text": "The soldiers crowd behind the final defensive line, shields layered over shields, breath spilling out in white clouds. No one speaks—they are waiting." },

  {
	"event": [
	  { "action": "spawn_character", "target": "Alicia", "pos": [-450, 0] },
	  { "action": "show_name", "target": "Alicia" }
	],
	"text": "Alicia steps to the very front. Her cloak snaps straight in the wind, her cracked sword seeming to grind its teeth."
  },

  { "text": "She doesn’t look back for reassurance, doesn’t offer comfort. She simply raises a hand—signaling everyone to hold the formation she drilled into them." },
  { "text": "The movement is practiced to perfection: one step, half-step, another—fitting precisely into the seam between wind and terrain." },

  {
	"event": [
	  { "action": "spawn_character", "target": "Mowang", "pos": [450, 0] },
	  { "action": "show_name", "target": "Mowang" }
	],
	"text": "From the depths of the rift, the Demon King’s silhouette rises. It seems pieced together from black mist, bone armor, and fragments of a shattered throne. In its chest yawns a hollow core, light within it writhing like something alive."
  },

  { "text": "Each time it ‘breathes,’ the snow collapses in rings, stones rattling upward before crashing back down." },

  {
	"event": [
	  { "action": "show_name", "target": "Mowang" },
	  { "action": "shake", "target": "Mowang" }
	],
	"text": "The Demon King speaks, its voice layered with countless whispers: “Re—turn—”"
  },

  { "text": "The blue barrier ripples under that sound, like water struck by a boulder." },
  { "text": "Alicia does not answer. She lifts her blade and points it toward the core—pinning the ‘ending’ to that single point." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Don’t look at its face. Look at its core.”"
  },

  { "text": "She launches forward. Not reckless, but terrifyingly precise—crushing the first rising stone underfoot, using it to leap over the second collapsing ring, landing exactly in the Demon King’s blind spot." },

  {
	"event": [{ "action": "shake", "target": "Alicia" }],
	"text": "Her first strike arcs in silver, cleaving open the outer layer of mist. It shrieks like torn flesh."
  },

  { "text": "The Demon King’s claw sweeps sideways, carving five cracks through the air." },
  { "text": "Alicia slides low, cloak skimming the snow, barely evading the talons." },

  {
	"event": [{ "action": "shake", "target": "Mowang" }],
	"text": "Her second strike doesn’t cut mist—it cuts the gap. The blade pierces a hairline fracture along the core’s edge. Black light bursts outward like a wounded eye."
  },

  { "text": "The recoil slams into her arm, shattering a plate of armor. She grunts—but does not retreat." },
  { "text": "The Demon King roars. Its bone armor splits, black ripples spilling outward, draining warmth from the snow as they pass." },
  { "text": "The ripple surges toward the defensive line—some soldiers nearly collapse." },
  { "text": "Alicia pivots, slicing sideways—not cutting energy, but cutting its path." },
  { "text": "The ripple bends, grazing the shield wall before detonating against the city walls in an explosion of stone." },
  { "text": "She shifts disaster away with her own positioning." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Hold your ground!”"
  },

  { "text": "The Demon King raises another claw—not striking, but pressing, as if to shove her back into the rift and force her to ‘return.’" },
  { "text": "She blocks, knee slamming into the snow, carving a deep crater." },
  { "text": "The pressure bursts her shoulder guard. Blood seeps down her gauntlet, black against the snow." },
  { "text": "She grits her teeth—and steps forward into the crushing weight." },

  {
	"event": [{ "action": "shake", "target": "Alicia" }],
	"text": "Her third strike rises from below, blade tracing the fracture in the core, tearing it open further."
  },

  { "text": "The core contracts violently, black light writhing as if to swallow her sword. She jerks it free, her arm scorched." },
  { "text": "A spine-like tail of condensed mist lashes toward her." },
  { "text": "She leaps, lands atop the writhing spine, and uses its motion to vault higher—like riding a wave." },
  { "text": "Midair, she adjusts, blade aimed directly at the core from above." },

  {
	"event": [{ "action": "shake", "target": "Mowang" }],
	"text": "Her fourth strike plunges downward, piercing through the mist’s outer layer and pinning the core’s edge. Black light blossoms like a dark flower."
  },

  { "text": "But the Demon King learns in that same instant. The mist spirals around her blade, trying to bind her whole body." },
  { "text": "She lands. Black mist coils around her ankle, cold like fingers on bone." },
  { "text": "She doesn’t resist. Instead, she gives in to the pull—letting it drag her directly before the core." },
  { "text": "It is the most dangerous position. It is also the only one." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“…Finally opened the door.”"
  },

  { "text": "She tears open the clasp inside her cloak and draws out the necklace—the Echo Order leader’s token. The pendant burns in the black light." },
  { "text": "The Demon King senses termination. The mist surges violently toward her wrist." },
  { "text": "It only needs to steal that instant for the loop to continue." },
  { "text": "Her fingers tremble—exhaustion crashing down at the worst moment." },
  { "text": "And in that instant, someone breaks from the defensive line behind her." },

  {
	"event": [
	  {
		"action": "show_option_ui",
		"options": [
		  { "text": "Option A: Loudly declare your love for Alicia 【DC 10 Charisma】", "dc": 10, "check": "charisma" },
		  { "text": "Option B: Shout at the monster and throw a stone to draw its attention and create an opening 【DC 10 Strength】", "dc": 10, "check": "strength" },
		  { "text": "Option C: Do nothing 【DC 0】", "dc": 0, "check": "dexterity" }
		]
	  },
	  { "action": "hide_talk_ui" }
	]
  }
]
