[
  {
	"event": [
	  { "action": "set_background", "target": "tavern_night" },
	  { "action": "show_talk_ui" }
	],
	"text": "(3.4.1.0 — Success)"
  },
  {
	"text": "I move around the table and lean down to look at her. She’s slumped against the edge, breathing lightly—like she’s finally stolen a little bit of peace."
  },
  {
	"text": "I slide the candleholder aside, careful not to let the firelight sting her eyelids. Then I bend down slowly, slipping my arm beneath her shoulders. She’s lighter than I expected—so light it makes my chest tighten."
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“…I’ll take you back to your room.”"
  },
  {
	"text": "She doesn’t respond. Her brow only creases slightly, as if she’s still running in her dreams. The staircase waits in the dark, each step reminding me: don’t make a mistake."
  },
  {
	"text": "I go upstairs one step at a time, deliberately placing my feet lightly, avoiding the boards I know will creak. She shifts faintly in my arms but doesn’t wake—only rubs her forehead against my chest, instinctively."
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“Almost there.”"
  },
  {
	"text": "I push the door open and lay her down on the bed. Her silver hair fans out across the pillow, like a layer of cold light."
  },
  {
	"text": "I pull the blanket up over her shoulders, tucking the edges in carefully, as if the wind might slip in through any gap."
  },
  {
	"text": "Just as I’m about to withdraw my hand, her fingers suddenly catch my sleeve—there’s barely any strength in them, but the grip is stubborn, like she’s afraid I’ll disappear."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“…Thank you.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“I… really love you.”"
  },
  {
	"text": "Her voice is heavy with sleep, like she’s telling the truth inside a dream. After that, her fingers loosen, and her breathing slowly evens out."
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "I stand there for a while before gently pulling the door closed."
  },
  {
	"text": "The corridor air is cold—but my palm is still burning."
  },
  {
	"event": [
	  { "action": "change_scene", "target": "scene3.5" }
	]
  }
]
