[
  {
	"event": [
	  { "action": "set_background", "target": "tavern" },
	  { "action": "unlock", "target": "3_6" },
	  { "action": "show_talk_ui" }
	],
	"text": "The first wave of late-morning customers crowds in, snowmelt trailing across the floor. Chair legs scrape in sharp bursts, like a string of small explosions."
  },

  { "text": "I’m still deciding who to greet first when Alicia ties an apron around her waist—like fastening the final buckle of armor." },

  {
	"event": [{ "action": "spawn_character", "target": "Alicia", "pos": [450, 0] }]
  },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Two tables want stew. One bread. One hot wine.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“How do you—”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“I can smell it.”"
  },

  { "text": "She lifts a tray and walks off. Not fast—but never a wasted step. The tray in her hands is as steady as if nailed to the air." },

  { "text": "One of the customers laughs and makes a crude remark, pointing at her." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Drink if you’re drinking.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“If not, shut your mouth before the soup gets cold.”"
  },

  { "text": "The man’s grin stiffens. Someone beside him tugs his sleeve. The entire table goes quiet—like they’ve suddenly remembered an unspoken rule." },
  { "text": "She doesn’t spare them another glance. She sets down the wine and taps the table lightly. A clear, precise sound—like a signal that the matter is settled." },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“You’ll scare off customers doing business like that.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“No.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“The ones who scare easily usually can’t afford to pay.”"
  },

  { "text": "When she says it, there’s the faintest spark of satisfaction in her expression—brief as an ember. Something different. Something almost fresh." },
  { "text": "She turns to the next table, shifting tasks like changing formation in battle." },
  { "text": "Pouring wine. Refilling stew. Taking coin. Wiping tables. Every motion executed as if practiced countless times." },

  { "text": "I pass her a plate of fresh stew from the kitchen. When she takes it, her fingers brush mine—and pause for a second." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“See?”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“This is what I want.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“What?”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“No blades. No blood.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“You hand me a plate. I put it down. And then—it’s over.”"
  },

  { "text": "Her voice is quiet, but beneath it is a sentence she doesn’t say aloud: I haven’t lived like this in too long." },

  { "text": "By afternoon, the rush thins out. She slides the last coin into my palm, like turning over spoils after a campaign." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Being the innkeeper’s wife isn’t bad.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“The victories here are simple: customers are fed, the wine stays hot, and you’re not hurt.”"
  },

  { "text": "When she says you’re not hurt, her eyes drop instinctively to my hands—like inspecting something she has sworn to protect." },
  { "text": "For a fleeting second, she looks like she’s back in her true role—not carrying plates, but guarding something so fiercely she’d rather die than see it break." },

  {
	"event": [
	  { "action": "change_scene", "target": "scene3.7" }
	]
  }
]
