[
  {
	"event": [
	  { "action": "set_background", "target": "north_gate_battlefield" },
	  { "action": "unlock","target": "BadEndding1" },
	  { "action": "show_name", "target": "Player" }
	],
	"text": "The moment I break from the shield line, the snow beneath my feet gives way. Not a slip—collapse."
  },

  { "text": "The Demon King’s ‘breath’ makes the ground pulse like a living thing. I step into nothingness, my knee slamming into shattered ice. White pain floods my vision." },
  { "text": "I try to rise. Try to shout the words. But the black mist reaches my ears first. It isn’t sound—it’s command." },

  {
	"event": [{ "action": "shake", "target": "Player" }],
	"text": "“Re—turn—” The syllables crawl across my throat like frozen fingers closing over my windpipe."
  },

  { "text": "My mouth opens. Only broken vapor escapes. The vow never forms—like a match that never catches, snuffed out by wind." },

  {
	"event": [
	  { "action": "show_name", "target": "Mowang" },
	  { "action": "shake", "target": "Mowang" }
	],
	"text": "The Demon King tilts its head. Not drawn to me—only acknowledging the extra piece on the board."
  },

  { "text": "When its gaze lands, my body locks in place. Not fear—worse. Recognition. As if it has watched me fail across countless loops." },
  { "text": "The mist tightens. No hesitation now. It surges like a tide reclaiming its shape." },

  { "text": "I see Alicia’s fingers tremble again—this time not from exhaustion. This is what half a second costs." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“…Don’t come out.”"
  },

  { "text": "She turns her head just enough to look at me. No anger. Only a calm that belongs to someone already standing at the edge." },

  { "text": "No time remains. The necklace is in her hand. The core is within reach. But the mist coils around her wrist." },

  {
	"event": [{ "action": "shake", "target": "Alicia" }],
	"text": "She forces the chain toward the fracture in the core—yet this time, the crack seals. Black light floods upward, biting into the pendant like a living maw."
  },

  { "text": "A claw descends. Not a strike—correction. As if returning her to her assigned place in the pattern." },
  { "text": "She raises her arm to block. Her shoulder guard explodes under pressure. Blood spills dark against snow." },
  { "text": "She steps forward anyway—closing distance with the only currency she ever spends: herself." },

  { "text": "But this time—there is no opening." },

  {
	"event": [
	  { "action": "shake", "target": "Mowang" },
	  { "action": "shake", "target": "Alicia" }
	],
	"text": "The mist recoils and lashes outward, freezing into chains around her throat, wrists, ankles. Her body is wrenched upward, suspended before the core."
  },

  { "text": "Her sword falls into the snow with a dull sound. It is louder than any scream." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "Her lips move. Maybe a command. Maybe an apology. Maybe—at last—a goodbye."
  },

  { "text": "The mist crushes the words before they exist. Her eyes remain bright—then slowly lose focus." },
  { "text": "The Demon King presses her toward the fracture. Not tearing. Erasing. Like wiping a name from a page." },

  {
	"event": [
	  { "action": "remove_character", "target": "Alicia" }
	],
	"text": "In the next heartbeat, Alicia vanishes into black light—necklace and all. Gone without residue."
  },

  { "text": "For one suspended instant, the wind does not move. The world itself forgets to breathe." },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "Something tears from my throat that doesn’t sound human."
  },

  { "text": "I try to run. My legs are lead. Someone shouts my name behind the shield wall—but it reaches me like sound underwater." },
  { "text": "The barrier’s blue glow fractures, shards falling like broken glass. The soldiers’ breathing dissolves into panic." },

  {
	"event": [
	  { "action": "shake", "target": "Mowang" }
	],
	"text": "The core in the Demon King’s chest stabilizes. No longer turbulent—perfectly aligned. The loop corrects itself."
  },

  { "text": "Black mist expands in a tidal surge—over snow, over shields. The city walls groan like splitting bone." },

  {
	"event": [
	  { "action": "hp_lost", "amount": 999 }
	],
	"text": "Cold pierces my chest—as if the world has passed sentence. As darkness closes in, one thought remains: this time, I didn’t reach her."
  },

  {
	"event": [
	  {
		"action": "game_over",
		"message": "You stepped forward.\n\nHalf a second too late.\n\nShe was erased.\nThe loop corrected.\n\nTime realigned.\nThe world continued.\n\nAnd you remained on the wrong side of it.\n\n—— The Vow That Never Landed · BAD END ——"
	  }
	]
  }
]
