[
  {
	"event": [
	  { "action": "set_background", "target": "north_gate_battlefield" },
	  { "action": "show_talk_ui" }
	],
	"text": "The sky beyond the North Gate looked as if it had been poured over with molten iron—heavy, black, and sinking. Wind whipped snow-grit against the armor, making a fine, scraping hiss."
  },
  { "text": "Only a thin layer of blue light remained in the barrier, like dying skin clinging to the outside of the city wall, flickering bright and dim." },
  { "text": "The soldiers crowded along the last defensive line, shield stacked on shield, each breath blooming into white mist. No one spoke—they were all waiting." },
  {
	"event": [
	  { "action": "spawn_character", "target": "Alicia", "pos": [-450, 0] },
	  { "action": "show_name", "target": "Alicia" }
	],
	"text": "Alicia stepped to the very front. The wind yanked her cloak straight, and her cracked longsword seemed to grit its teeth in a low, wordless snarl."
  },
  { "text": "She didn’t turn back to check. She didn’t reassure anyone. She simply raised a hand—signaling everyone to hold the formation she had drilled into them." },
  { "text": "The motion was practiced to a frightening degree: one step, half a step, then another—perfectly wedged into the seam between the wind’s angle and the terrain." },
  {
	"event": [
	  { "action": "spawn_character", "target": "Mowang", "pos": [450, 0] },
	  { "action": "show_name", "target": "Mowang" }
	],
	"text": "From the depths of the rift, the Demon King’s outline slowly rose. It looked stitched together from black mist, bone armor, and the shattered remnants of a throne—its chest an empty, hollow core where light churned like a living thing."
  },
  { "text": "With every ‘breath’ it took, the snowfield caved in in a widening ring, stones jolting up and dropping back down." },
  {
	"event": [
	  { "action": "show_name", "target": "Mowang" },
	  { "action": "shake", "target": "Mowang" }
	],
	"text": "The Demon King spoke, its voice layered with countless whispers: “Come—back—.”"
  },
  { "text": "The blue barrier rippled from the sound, like water struck by a boulder." },
  { "text": "Alicia didn’t answer. She lifted her sword, the tip aimed at the core—like she was pinning the very idea of an ‘ending’ to that single point." },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "Alicia murmured, “Don’t look at its face. Look at its core.”"
  },

  { "text": "She charged. Not a reckless rush, but a terrifyingly precise entry: she crushed the first floating stone underfoot, used it as a spring to clear the second ring of collapse, and landed exactly in the Demon King’s left-side blind spot." },
  {
	"event": [
	  { "action": "shake", "target": "Alicia" }
	],
	"text": "The first strike fell—silver light drawing a half-moon that cleanly peeled open the outer layer of black mist. The mist shrieked, like skin being torn."
  },
  { "text": "The Demon King’s claw swept across, ripping five裂-like cracks through the wind." },
  { "text": "Alicia slid low, her cloak skimming the snow, dodging so close the claw tips nearly grazed her." },
  {
	"event": [
	  { "action": "shake", "target": "Mowang" }
	],
	"text": "For the second strike, she didn’t cut mist—she cut the ‘gap.’ The sword tip stabbed into a hairline fissure along the edge of the core, and black light burst out like a wounded eye."
  },
  { "text": "The recoil slammed into her arm; a plate of armor shattered off on the spot. She grunted, but didn’t give ground." },
  { "text": "The Demon King roared. Bone armor split apart, releasing concentric ripples of black—ripples that skimmed the snow and turned it gray, as if the warmth had been stolen away." },
  { "text": "The ripples surged toward the defensive line; soldiers’ legs went weak, and some nearly dropped to their knees." },
  { "text": "Alicia snapped her blade back and cut across—she didn’t sever the energy, she severed the ‘trajectory.’" },
  { "text": "Forced to bend, the ripples scraped past the edge of the shield wall and slammed into the city wall; stone exploded outward." },
  { "text": "With her positioning, she diverted the disaster away from them." },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "Alicia barked, “Don’t move! Hold your ground!”"
  },

  { "text": "The Demon King raised its other claw and pressed down on her. It wasn’t an attack—it was like it meant to pin her straight into the rift, to send her ‘back.’" },
  { "text": "Alicia braced and blocked with her arm; her knees sank hard, compressing the snow into a deep crater." },
  { "text": "The pressure cracked her shoulder guard; blood seeped along her bracer and dripped onto the snow, darkening it." },
  { "text": "Gritting her teeth under that crushing weight, she stepped forward instead—forcing herself even closer." },
  {
	"event": [
	  { "action": "shake", "target": "Alicia" }
	],
	"text": "The third strike—an upward cut. Her blade tracked along the fissure in the core like prying open a wound into a cleaner, wider mouth."
  },
  { "text": "The core contracted abruptly. Black light surged, as if trying to swallow the sword. She yanked it back, a scorch line burned across her arm." },
  { "text": "The Demon King’s tail whipped in—a spine of condensed black mist, bristling with barbs." },
  { "text": "Alicia leapt, landed on that spine, and used its swing to fling herself upward in reverse—like riding a wave to flip over." },
  { "text": "In midair she adjusted her posture, sword point aligned directly above the core." },
  {
	"event": [
	  { "action": "shake", "target": "Mowang" }
	],
	"text": "The fourth strike plunged straight down, piercing the outer mist and pinning into the rim of the core. Black light burst outward in a ring, like a black flower blooming."
  },
  { "text": "But in that instant, the Demon King ‘learned.’ Its black mist began to spiral around the blade, trying to entangle her whole body." },
  { "text": "Alicia landed; black mist coiled around her ankle, its cold touch gripping bone-deep." },
  { "text": "She didn’t struggle. Instead, she loosened a step and surrendered her center of gravity to the pull—letting it drag her straight in front of the core." },
  { "text": "It was the most dangerous position. It was also the only position." },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "Alicia whispered, “So you finally opened the door.”"
  },

  { "text": "She tore open the clasp inside her cloak and drew out a necklace—the leader’s token of the Echo Society. The pendant glowed painfully bright in the black light." },
  { "text": "Sensing ‘termination,’ the Demon King’s mist surged violently, like a tide crashing toward her wrist." },
  { "text": "It wanted to steal that single instant. Steal it—and the loop would continue." },
  { "text": "Alicia’s fingers trembled— not from fear, but from the weight of exhaustion pressing down for one heartbeat." },
  { "text": "In that exact heartbeat, someone burst out from behind the defensive line." },
  {
	"event": [
	  {
		"action": "show_option_ui",
		"options": [
		  { "text": "Option A: Declare your love for Alicia (shout: 'No matter how many times, I will wait for you!')", "dc": 10, "check": "charisma" },
		  { "text": "Option B: Shout at the monster and throw a stone to draw its attention and create an opening for Alicia", "dc": 10, "check": "dexterity" },
		  { "text": "Option C: Do nothing", "dc": 0, "check": "dexterity" }
		]
	  },
	  { "action": "hide_talk_ui" }
	]
  }
]
