[
  {
	"event": [
	  { "action": "hide_talk_ui" },
	  { "action": "set_background", "target": "tavern_night" },
	  { "action": "unlock", "target": "3_4_2" },
	  { "action": "spawn_character", "target": "Alicia", "pos": [-250, 0] },
	  { "action": "show_talk_ui" }
	]
  },

  { "text": "I don’t touch her again. I just clear away her plate and wine glass, moving the candle a little farther so the flame won’t shine directly into her eyes." },
  { "text": "She’s resting on the table, the red fabric of her dress glowing softly in the firelight like a quiet flame. But she herself feels fragile—her shoulders rising and falling so faintly it’s almost like paper." },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“You can sleep here… I’m staying.”"
  },

  { "text": "I take off my coat and gently drape it over her shoulders. I move slowly, like disarming something that might make noise if handled wrong." },
  { "text": "She doesn’t wake. In her sleep, her brow creases faintly—as if she’s finally heard an answer she can trust." },

  { "text": "Wind slips through the crack beneath the door, carrying the scent of snow. I drag a chair closer to her side, placing half my body between her and the draft." },
  { "text": "Then I lean forward too, resting my forehead on my arm—but I don’t dare close my eyes completely." },

  { "text": "The night is long. The fire in the hearth dims again and again. I get up twice to add wood. Each time, I look back at her to make sure she’s still there—still on this page of the world." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“…Don’t go.”"
  },
  { "text": "She says it softly in her sleep, like a command drifting back from somewhere very far away." },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“I won’t.”"
  },

  { "text": "I rest my hand on the edge of the table, close to her fingers—but not touching. Like guarding a boundary: as long as I don’t disturb her, she can sleep a little longer." },
  { "text": "In the second half of the night, the snow grows quieter, the wind colder. I tuck the edges of my coat tighter around her. My own shoulder goes numb from the cold, but I don’t move away." },

  { "text": "At some point, my eyelids finally sink shut. The last thing I see is the candlelight flickering in her hair—like it’s keeping watch in my place." },

  {
	"event": [
	  { "action": "set_background", "target": "tavern" }
	],
	"text": "By morning, the fog presses against the windows again. The hearth holds only a dull warmth."
  },

  { "text": "I wake at the table, my neck aching like it’s been twisted. My arm is numb, yet my fingers still hold their position from last night—as if moving might wake her." },

  { "text": "Alicia is still resting there. Her breathing is steadier than before, her brow finally smooth. The folds of her red dress hold a faint warmth from the firelight—like she’s briefly crossed back to the side of being human." },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“Morning…”"
  },

  { "text": "My voice is quiet. She doesn’t wake immediately—only her lashes tremble slightly. For a fleeting second, I have a ridiculous thought: if I could just let her sleep a little longer, maybe today itself would stretch with it." },

  {
	"event": [
	  { "action": "change_scene", "target": "scene3.5" }
	]
  }
]
