[
  {
	"event": [
	  { "action": "set_background", "target": "north_gate_battlefield" },
	  { "action": "unlock","target": "BadEndding2" },
	  { "action": "show_name", "target": "Player" }
	],
	"text": "The moment I grab the broken stone, my fingers are so stiff I can barely hold it. The blizzard roars, the Demon King’s mist surging like a living thing—I misjudge the thin point."
  },

  { "text": "I throw the stone anyway—like hurling the last of my hope into an abyss." },

  {
	"event": [{ "action": "shake", "target": "Mowang" }],
	"text": "The stone doesn’t strike a weakness. It vanishes into the mist without even a sound."
  },

  { "text": "In the next instant, the mist lifts like an offended beast." },
  { "text": "The Demon King isn’t distracted. It locks on." },

  {
	"event": [{ "action": "show_name", "target": "Mowang" }],
	"text": "Its voice grinds along my bones: “You—will—return—too—”"
  },

  { "text": "The whisper burrows into my ears. My knees buckle at once. Not fear—something fouler. Recognition. As if it has watched me struggle across countless loops." },
  { "text": "The mist lashes outward, stretching into a massive claw reaching for me." },

  {
	"event": [{ "action": "shake", "target": "Player" }],
	"text": "I try to retreat behind the shields, but the snow collapses under my feet. I barely raise my arm—then icy force grips my chest."
  },

  { "text": "A broken gasp tears from my throat. The world slows, tightened like a wire." },
  { "text": "And in that suspended instant, I see the necklace in Alicia’s hand—she’s about to drive it into the core." },
  { "text": "Her fingers tremble—not from fear, but from exhaustion crashing down." },
  { "text": "I understand at last: if she turns to save me now, she loses that half-second." },
  { "text": "But she turns anyway." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“…Don’t look at me. Close your eyes.”"
  },

  { "text": "She cannot win both sides. She has to choose." },

  {
	"event": [{ "action": "shake", "target": "Alicia" }],
	"text": "She pivots sharply, blade sweeping sideways, tearing the mist claw away from me. The darkness shrieks like ripped flesh."
  },

  { "text": "That strike saves me—and steals her chance." },
  { "text": "The Demon King’s focus returns to her completely. The mist no longer falters; it coils back like chains around her wrists and throat." },
  { "text": "The necklace slips from her fingers, landing in the snow with a sound almost too faint to hear." },
  { "text": "Yet that faint sound is sharper than any scream." },

  {
	"event": [{ "action": "shake", "target": "Mowang" }],
	"text": "The Demon King’s claw descends—not a slash, but a correction. Pressing her back toward the rift, forcing the loop into alignment."
  },

  { "text": "She raises her arm to block. Her shoulder armor bursts under the pressure. Blood seeps down her gauntlet, black against the snow." },
  { "text": "She steps forward anyway—closing distance the only way she ever does: trading her life for an opening." },
  { "text": "But this time, there is no opening." },

  {
	"event": [{ "action": "remove_character", "target": "Alicia" }],
	"text": "Black light flashes—like someone erasing a piece of the world. Alicia’s form is swallowed, so cleanly that even her footprints seem to fade."
  },

  { "text": "A hollow ringing fills my skull, like something shattered inside." },
  { "text": "The barrier’s blue glow fractures, shards falling like broken glass. The soldiers’ breaths dissolve into panic." },
  { "text": "The core in the Demon King’s chest brightens again—terribly stable. The loop continues." },

  {
	"event": [{ "action": "hp_lost", "amount": 999 }],
	"text": "The mist surges toward me. Cold pierces my chest—as if the world itself has passed judgment. As darkness consumes my sight, one thought remains: I saved myself—and lost her."
  },

  {
	"event": [
	  {
		"action": "game_over",
		"message": "You saved yourself.\n\nShe took the blow meant for you.\n\nThe necklace fell.\nThe core realigned.\n\nThe loop corrected.\n\nThis time,\nthe price was her.\n\n—— A Misplaced Choice · BAD END ——"
	  }
	]
  }
]
