[
  {
	"event": [
	  { "action": "set_background", "target": "north_gate_battlefield" },
	  { "action": "unlock","target": "3_11_2" },
	  { "action": "show_name", "target": "Player" }
	],
	"text": "I don’t shout a vow. Emotion won’t save her right now—I need a gap. A slit wide enough for her to drive the necklace through."
  },

  { "text": "I snatch up the hardest shard of stone from the snow and scoop a fistful of jagged ice into my palm. The splinters cut my skin. The pain clears my head." },
  { "text": "The Demon King’s black mist spirals before the core, looping like chains waiting to snap around her wrist." },
  { "text": "I don’t look at its face. I fix my eyes on the thinnest edge of the mist—like watching for the blink of an eye." },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "I draw in a breath, press my voice low—then let it explode."
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“Hey—! Over here!”"
  },

  {
	"event": [{ "action": "shake", "target": "Mowang" }],
	"text": "I hurl the stone. It cuts through wind and snow, striking the edge of the mist—not solid flesh, but its shape."
  },

  { "text": "The mist flinches, contracting for a split second like pricked skin. That contraction exposes the edge of the core’s fracture—like a door cracking open to light." },
  { "text": "The Demon King’s focus shifts—not because I’ve ‘drawn’ it, but because it must react. The mist moves to repair the punctured thin point." },
  { "text": "And repairing means something else must loosen." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "Alicia’s eyes change. Not surprise—calculation. A hunter recognizing an opening."
  },

  { "text": "Her fingers had been trembling—exhaustion pressing down like an old wound reopening." },
  { "text": "But when the mist loosens by a thread, her grip steadies." },

  {
	"event": [{ "action": "shake", "target": "Alicia" }],
	"text": "She tears open the clasp inside her cloak and pulls the necklace free. The pendant burns in the black light, but she holds it without hesitation."
  },

  { "text": "The Demon King senses termination. The mist lashes back like a tide snapping at prey." },
  { "text": "I have no second stone. Only one choice remains: make it believe the threat is still me." },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "I shout at it, voice tearing my throat raw, forcing my heartbeat into the darkness."
  },

  {
	"event": [{ "action": "shake", "target": "Mowang" }],
	"text": "“Come on! Aren’t you dragging everything back? Look at me!”"
  },

  { "text": "The mist shifts again—just slightly. It doesn’t need to understand my words. It only needs to divide its focus—if only for half a second." },
  { "text": "Half a second is the distance between life and death." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "Her voice is hoarse, but she’s smiling. “…Good.”"
  },

  {
	"event": [{ "action": "shake", "target": "Alicia" }],
	"text": "She seizes the loosened seam and drives the necklace into the core’s fracture. The instant it sinks in, light ignites from within, bursting outward."
  },

  { "text": "The Demon King howls, distorted and tearing. Its bone armor splits, fractures racing up into the sky." },
  { "text": "Behind her, the core collapses inward—like the world drawing a breath." },

  {
	"event": [
	  { "action": "shake", "target": "Alicia" },
	  { "action": "shake", "target": "Player" }
	],
	"text": "The shockwave detonates outward. Snow and shattered stone surge like a white tide. Even the city walls tremble. Alicia is hurled toward me."
  },

  { "text": "In midair, she twists—turning her back to the blast, shielding me from the worst of the storm." },

  {
	"event": [{ "action": "change_scene", "target": "scene3.12" }]
  }
]
