[
  {
	"event": [
	  { "action": "set_background", "target": "north_gate_battlefield" },
	  { "action": "unlock","target": "BadEndding3" },
	  { "action": "show_name", "target": "Player" }
	],
	"text": "I don’t rush forward."
  },

  { "text": "The blizzard is too fierce. The shield wall too tight. The Demon King too close. Every reason presses against my chest like a stone, forcing that step back down my throat." },
  { "text": "I tell myself: she said ‘don’t move.’ She said ‘hold your ground.’ If I don’t get in the way, that’s already helping." },
  { "text": "But I know the truth—that’s just fear dressed up as obedience." },

  { "text": "The necklace burns in Alicia’s hand, glowing red in the black light like heated iron." },
  { "text": "The Demon King senses termination. The mist surges violently, crashing toward her wrist." },
  { "text": "Her fingers tremble—not from fear, but from exhaustion crashing down." },
  { "text": "That instant. That single instant. And I do nothing." },

  {
	"event": [
	  { "action": "show_name", "target": "Mowang" },
	  { "action": "shake", "target": "Mowang" }
	],
	"text": "The Demon King’s voice layers over itself in countless whispers: “Re—turn—”"
  },

  { "text": "The sound grinds along bone. The mist tightens as if obeying command, coiling around her wrists, ankles, throat." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "Alicia’s breathing grows shallow. She doesn’t look back at me. She only steadies her blade toward the core."
  },

  { "text": "She tries to force the necklace into place—but the mist clamps onto it like a living jaw." },
  { "text": "She strains. Her knuckles whiten. Veins rise along her hand. The pendant advances half an inch—then is dragged back." },

  { "text": "The Demon King’s claw descends. Not a strike—correction. Pressing her back toward the rift. Back into the loop. Back into fate’s old alignment." },

  {
	"event": [{ "action": "shake", "target": "Alicia" }],
	"text": "She raises her arm to block. Her knee slams into the snow, carving a crater. Her shoulder armor bursts. Blood seeps down her gauntlet, black against the white."
  },

  { "text": "She still steps forward—closing distance the only way she ever does: trading her life for an opening." },
  { "text": "But this time, no one steals that half-second for her." },

  { "text": "The mist recoils and lashes back, freezing into chains around her throat and limbs. Her body is yanked upward, suspended before the core." },
  { "text": "Her sword falls into the snow with a dull, final sound." },
  { "text": "That sound makes me understand: I am still standing—and she is losing everything." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "Her lips move. Maybe a command to retreat. Maybe—at last—a goodbye."
  },

  { "text": "The mist crushes the words before they form. Her eyes remain bright—then slowly lose focus." },
  { "text": "The Demon King presses her toward the rift. Not tearing—erasing. Like wiping a name from the world." },

  {
	"event": [{ "action": "remove_character", "target": "Alicia" }],
	"text": "In the next heartbeat, Alicia is swallowed by black light—necklace and all—gone without trace."
  },

  { "text": "The wind pauses. Not because it stops—because my world does." },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "I try to run forward—but my legs are lead. My throat locks, releasing only broken gasps."
  },

  { "text": "Someone shouts behind the shield wall, someone tries to pull me back—but I can’t hear them." },
  { "text": "The barrier’s blue light fractures, shards falling like glass. The soldiers’ breathing turns to panic." },
  { "text": "The core in the Demon King’s chest brightens again—terribly stable. The loop continues." },
  { "text": "Black mist floods outward in a tidal wave, rolling over snow and shields alike. The city walls groan as if splitting apart." },

  {
	"event": [{ "action": "hp_lost", "amount": 999 }],
	"text": "Cold pierces my chest—as if the world has passed sentence. As darkness swallows my sight, one thought remains: I didn’t save her. I didn’t even try."
  },

  {
	"event": [
	  {
		"action": "game_over",
		"message": "You stood still.\n\nShe stepped forward.\n\nAnd then she was gone.\n\nThe loop continues.\n\nThis time,\nyou did nothing.\n\n—— Standing Aside · BAD END ——"
	  }
	]
  }
]
