[
  {
	"event": [
	  { "action": "hide_talk_ui" },
	  { "action": "set_background", "target": "tavern_night" },
	  { "action": "unlock", "target": "3_4_1" },
	  { "action": "spawn_character", "target": "Alicia", "pos": [-250, 0] },
	  { "action": "show_talk_ui" }
	]
  },

  { "text": "I walk around the table and lean down to look at her. She’s resting against the edge, breathing softly—like she’s stolen a fragile moment of peace." },
  { "text": "I move the candle aside so the light won’t sting her eyelids. Then I bend carefully, slipping one arm beneath her shoulders. She’s lighter than I expected—light enough to make my chest tighten." },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“…I’ll take you to your room.”"
  },

  { "text": "I carry her upstairs. Just as I reach the turn in the stairwell, my foot slips—like I’ve stepped on a trace of spilled oil." },
  { "text": "My heart drops. I can’t recover in time. My knee slams into the step and I pitch forward." },

  {
	"event": [{ "action": "shake", "target": "Player" }],
	"text": "“Tch—!”"
  },

  { "text": "I shield her as best I can, but she still jolts in my arms. Her lashes flutter sharply—and then her grey-blue eyes snap open in the dark." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“…What are you doing?”"
  },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“Sorry! I—I slipped… I was just trying to bring you upstairs.”"
  },

  { "text": "She studies me. There’s no anger in her gaze—only the exhaustion of being dragged out of a rare quiet moment. She exhales and steadies herself, slipping from my arms." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Don’t carry me.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“I can walk.”"
  },

  { "text": "She grips the railing. Her steps are slightly unsteady—but stubborn. After two steps, she glances back to make sure I haven’t fallen again." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Next time, don’t push yourself.”"
  },

  { "text": "She opens her door and steps inside. The click of it closing is soft—but it feels like being shut out." },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "I stand at the top of the stairs, rubbing my aching knee, a quiet sting spreading through my chest."
  },

  {
	"event": [
	  { "action": "change_scene", "target": "scene3.5" }
	]
  }
]
