[
  {
	"event": [
	  { "action": "set_background", "target": "town_snow_street" },
	  { "action": "unlock","target": "3_9" },
	  { "action": "show_talk_ui" }
	],
	"text": "The third morning arrives too quickly. The snow has paused, leaving a thin crust of ice that crunches underfoot."
  },
  { "text": "When I push open the inn door, the air carries a faint metallic scent—like someone has been sharpening blades nearby." },
  { "text": "From the direction of the North Gate comes the sound of synchronized marching—steady, deliberate, forcing chaos into rhythm." },

  {
	"event": [
	  { "action": "set_background", "target": "north_gate" }
	],
	"text": "I follow the street to the open ground outside the gate. The fog hasn’t lifted. The barrier’s blue glow clings to the wall like a thin membrane, pulsing faintly."
  },
  { "text": "Dozens of soldiers have gathered. Shields grounded. Spears upright. No laughter—only breath and the soft scrape of armor." },
  { "text": "They don’t look like men waiting for orders. They look like men waiting for someone who can make them believe they’ll survive the night." },

  {
	"event": [
	  { "action": "spawn_character", "target": "Alicia", "pos": [-450, 0] },
	  { "action": "show_name", "target": "Alicia" }
	],
	"text": "Alicia stands at the front. No red dress. No soft cloak. She wears light armor, sleeves tightened, as if preparing for something routine."
  },

  { "text": "Her hair is simply tied back. Her face still pale—but her eyes clearer than the past two days. A clarity born from pressing exhaustion down to the bone." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Listen carefully.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“No heroics. No wasted courage. Just follow instructions.”"
  },

  { "text": "She gestures to the center of the field. Her voice isn’t loud—but it steadies everyone instinctively." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“First row, shields up. One arm’s distance apart. Second row, spears half-step forward—thrust only, do not chase. Third row, archers switch to short volleys. Conserve arrows.”"
  },

  { "text": "The commands come like memorized lines. No hesitation—only sequence." },
  { "text": "The soldiers move instantly. Shields slam down. Spears align. Archers reposition. The formation tightens under her voice." },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "I stand at the edge, palms cold. Her precision doesn’t feel trained—it feels repeated."
  },

  { "text": "She steps into the line and adjusts a young soldier’s shield angle herself." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Don’t let it shake. If you shake, someone behind you dies.”"
  },

  { "text": "The recruit pales—but steadies." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Good. Remember that feeling. Tonight, hold it.”"
  },

  { "text": "She glances at the barrier’s glow—checking an invisible measure. Then draws her sword." },
  { "text": "The blade flashes once. No flourish—just a demonstration of thrust, recover, step." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Don’t copy my swing. Copy my recovery.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“You live first. You strike again later.”"
  },

  { "text": "When she says “again,” her tone is calm—as if speaking about another meal. My chest tightens." },
  { "text": "The formation practices. Shield wall advances. Spear line pushes. Footsteps grow synchronized. The cold wind still bites—but for the first time, it feels survivable." },

  { "text": "Then—small running footsteps from the side street." },
  { "text": "A few children slip out, clutching cloth bundles and paper bags like they’ve snuck away." },
  { "text": "A girl with braided hair approaches timidly, lifting a small wrapped bundle on tiptoe." },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "I almost step forward to stop her—but she’s already there."
  },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "Alicia looks down."
  },

  { "text": "Inside the cloth: broken pieces of baked biscuits and a few candies wrapped in crinkled paper." },

  {
	"event": [{ "action": "show_name", "target": "Kid" }],
	"text": "“Miss… this is for you.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Kid" }],
	"text": "“You looked really cool just now!”"
  },

  { "text": "The soldiers tense instinctively, afraid this softness might break the rhythm." },
  { "text": "Alicia is silent for two seconds—like she’s forcing something back down her throat." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Thank you.”"
  },

  { "text": "She accepts the bundle. Doesn’t eat. Instead, she ties it securely at her waist—positioned so it won’t interfere with drawing her blade." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Go home. Don’t linger.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Kid" }],
	"text": "“Okay!”"
  },

  { "text": "The child runs off, waving once—like she believes this story ends in victory." },
  { "text": "Alicia’s gaze follows briefly. Then she locks it away again." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Resume training.”"
  },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Shield wall, ten steps. Halt. Archers, two short volleys. Halt. Spear line fill the gap. Repeat.”"
  },

  { "text": "The soldiers respond in unison. Movements steadier now." },
  { "text": "I watch her move between them—like someone dismantling disaster into manageable steps." },
  { "text": "And I know: the more orderly this is, the more certain she is about what will happen." },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "I almost ask her—how many mornings like this have you already lived?"
  },

  { "text": "But I don’t. Because she’s busy convincing everyone else they’ll survive tonight." },
  { "text": "And from the beginning—she never counted herself among them." },

  {
	"event": [
	  { "action": "change_scene", "target": "scene3.10" }
	]
  }
]
