[
  {
	"event": [
	  { "action": "set_background", "target": "town_gate_day" },
	  { "action": "show_talk_ui" }
	],
	"text": "The midday sun blazed high. The town gate stood half open, and the air carried a mix of charcoal and spice."
  },
  {
	"event": [
	  { "action": "spawn_character", "target": "Alicia", "pos": [450, 0] },
	  { "action": "show_name", "target": "Alicia" }
	],
	"text": "“See? I told you—the sun would be nice today.”"
  },
  {
	"text": "Alicia narrowed her eyes, gazing down the bustling street."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“A bit too nice—it’s blinding.”"
  },
  {
	"text": "I raised a hand to shield my eyes; the stone beneath my feet was warm from the heat."
  },
  {
	"text": "Vendors near the gate were emptying barrels of fruit. A sweet, ripe aroma mingled with the summer air as a few children dashed by, chasing paper pinwheels and laughter."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“So this is the marketplace.”"
  },
  {
	"text": "Her gaze wandered across the street with mild curiosity. “It’s livelier than I expected.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“You’ve never been here before?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“No. First time.”"
  },
  {
	"text": "She smiled faintly. “Patrol soldiers spend more time outside the walls than inside them.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Then you should take your time and enjoy it.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“If I hadn’t dragged you out, you’d probably still be in the forest, getting your leg chewed on by a monster.”"
  },
  {
	"text": "She gave a short huff, though there was a smile behind it."
  },
  {
	"text": "We crossed the town square together. Sunlight gleamed off the white stone statue, and the shadow of the clock tower stretched long across the ground. The sounds of chatter, metalwork, and hoofbeats merged into a vivid tapestry of life."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Finally, a place where I can breathe a little.”"
  },
  {
	"text": "She stretched lazily, a note of ease in her tone. “But don’t get too comfortable. If monsters are showing up nearby, we’ll probably have to check the western defenses later.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Can’t we rest first?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Sure.”"
  },
  {
	"text": "She raised an eyebrow. “But if we were in the wild, a monster wouldn’t wait for you to catch your breath before attacking again.”"
  },
  {
	"text": "I blinked. Sunlight danced over her golden hair, gleaming softly."
  },
  {
	"text": "I was about to argue when she turned back with a small, genuine smile that silenced me."
  },
  {
	"text": "The crowd began to thin, and the afternoon quiet settled over the street. Just then, a vendor’s call rang out ahead."
  },
  {
	"text": "Alicia looked at me, her eyes bright with curiosity. “Want to go take a look?”"
  },
  {
	"event": {
	  "action": "if_flag",
	  "flag": "injuredByMonster1",
	  "value": true,
	  "target": "scene1.5.1"
	}
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.5.2" }]
  }
]
