[
  {
	"event": [
	  { "action": "set_background", "target": "underground_entrance" },
	  { "action": "spawn_character", "target": "Lucia", "pos": [-450, 0] },
	  { "action": "spawn_character", "target": "EnemyLeader", "pos": [450, 0] },
	  { "action": "show_talk_ui" }
	],
	"text": "The air freezes in place. The chanting stops. Several pairs of eyes shift toward us from the shadows—cold, silent, yet burning with a twisted fervor."
  },
  {
	"text": "I don’t hesitate. Snow and grit scatter beneath my boots as I launch forward, firelight flashing along my short blade. The robed figures clearly didn’t expect me to charge straight in."
  },
  {
	"text": "The ritual circle still pulses. The nearest caster raises a hand, murmuring a spell. The air tightens like warped threads winding around me."
  },
  {
	"event": { "action": "shake", "target": "Player" },
	"text": "I twist to dodge—but my foot catches on loose stone. My blade slices through half an arc and misses. Blue light erupts in front of me."
  },
  {
	"event": { "action": "hp_lost", "amount": 15 },
	"text": "A searing pain rips through my arm, like being branded with heated iron. I stagger back, blood dripping from my sleeve onto the ground."
  },
  {
	"event": { "action": "show_name", "target": "Lucia" },
	"text": "“Hey! You’re bleeding!”"
  },
  {
	"text": "Lucia cries out and swings her staff. A wall of light surges up in front of me."
  },
  {
	"text": "Blue force slams into the barrier, sparks flying. Lucia’s face glows red in the reflection as she grits her teeth, bracing against the impact."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Forget me—free her first!”"
  },
  {
	"event": { "action": "show_name", "target": "EnemyLeader" },
	"text": "“The blood of mortals… is enough to awaken the core.”"
  },
  {
	"text": "A chill runs through me. I realize the sigils are lighting up along the trail of my blood. Blue lines slither back toward the stone pillar, feeding on it."
  },
  {
	"event": { "action": "show_name", "target": "Lucia" },
	"text": "“No—I’ll disrupt it!”"
  },
  {
	"text": "Her voice nearly drowns in the roaring energy. She forms a seal, her staff blazing brighter."
  },
  {
	"text": "She rushes forward, a sphere of light bursting from her hand and blasting the nearest robed figure off his feet."
  },
  {
	"text": "I force myself upright and lunge, hacking through the last restraint binding Alicia. In that instant, the ritual’s light recoils violently."
  },
  {
	"event": { "action": "shake", "target": "Player" },
	"text": "A violent backlash of energy slams into me. I’m thrown against the wall, breath crushed from my lungs, ears ringing until everything fades into a dull hum."
  },
  {
	"text": "Through blurred vision, I see Lucia kneeling, gasping. Alicia falls from midair, caught just in time by Lucia’s arms."
  },
  {
	"text": "The light dims. The air fills with the smell of ash and blood."
  },
  {
	"event": { "action": "show_name", "target": "EnemyLeader" },
	"text": "“Interlopers… you invite your own doom.”"
  },
  {
	"event": [
	  { "action": "remove_character", "target": "EnemyLeader" }
	],
	"text": "The leader’s voice cuts like frost. Then he turns and vanishes into warped light."
  },
  {
	"text": "The remaining robed figures scatter as the ritual circle collapses."
  },
  {
	"event": [
	  { "action": "spawn_character", "target": "Alicia", "pos": [450, 0] },
	  { "action": "show_name", "target": "Alicia" }
	],
	"text": "“Are you alright?!”"
  },
  {
	"text": "Gravely wounded, Alicia can only lean against Lucia’s shoulder as they move toward me step by step."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Don’t move.”"
  },
  {
	"text": "Her voice is weak but firm. Leaning on Lucia, she traces glowing sigils in the air."
  },
  {
	"text": "A soft radiance settles over my wound. The pain eases slightly, though blood still seeps. She exhales sharply. “Temporary clotting spell. You need rest.”"
  },
  {
	"text": "I manage a faint smile. “Looks like you and Lucia saved me again.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Your blood… the ritual absorbed part of it. You may have been drawn into its residual circuit.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Meaning?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“For now, nothing. But… if you approach similar spellwork again, it might respond.”"
  },
  {
	"text": "Her hand rests over mine, her palm cold. “Promise me you won’t rush in like that again.”"
  },
  {
	"text": "I hesitate. Her fingers tighten just slightly—barely any pressure, yet impossible to ignore."
  },
  {
	"event": [
	  { "action": "set_background", "target": "Street" }
	],
	"text": "We make our way out of the tunnel. The night wind outside cuts like a blade. In the distance, the inn’s lantern flickers."
  },
  {
	"event": { "action": "show_name", "target": "Lucia" },
	"text": "“Will they come back?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“They will.”"
  },
  {
	"text": "Alicia’s voice is low and strained. “But we’ll be faster.”"
  },
  {
	"text": "Snow crunches underfoot. The wind tangles her hair and scatters the last traces of the ritual’s energy."
  },
  {
	"text": "I glance down at my bandaged arm, unease stirring within me. The afterimage of that blue glow still seems to flicker deep beneath my skin."
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.7" }]
  }
]
