[
  {
	"event": [
	  { "action": "spawn_character", "target": "Alicia", "pos": [450, 0] },
	  { "action": "show_talk_ui" }
	]
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“I’ll try to change fate.” I answer a little hastily, but the moment the words leave my mouth, I realize they carry far more weight than I expected."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "Alicia smiles faintly. The expression is gentle, but it doesn’t reach her eyes. “Many people say that.”"
  },
  {
	"text": "She slowly swirls her glass, the amber liquid catching the firelight as it ripples in circles."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“But fate never listens to persuasion. You think you’re changing it, yet you’re only walking a little farther along the path it already laid out.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“What about you?” I ask. “Do you believe in fate, or are you fighting against it?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "Her hand pauses at the rim of the glass, her gaze settling into the glow of the fire. “I once believed I could win.”"
  },
  {
	"text": "The hearth flame leaps suddenly, a spark landing on her sleeve before she brushes it away. In that fleeting moment, I glimpse the shadow in her eyes—not fear, but exhaustion."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Fate isn’t a die,” she says quietly. “It won’t change its number just because you will it to.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“It sounds like… you’ve tried yourself.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She falls silent for a moment, then gives a faint smile. “Perhaps. But if I had the choice, I would rather not have tried at all.”"
  },
  {
	"text": "The smile is brief and fragile, as if concealing a wound too deep to name. Firelight flickers in her eyes, and in that shifting glow, even the air feels colder."
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.4" }]
  }
]
