[
  {
	"branch": "C_fail",
	"event": [
	  { "action": "spawn_character", "target": "Monster1", "pos": [-450, 0] },
	  { "action": "spawn_character", "target": "Alicia", "pos": [450, 0] },
	  { "action": "set_background", "target": "forest_path" },
	  { "action": "show_talk_ui" }
	],
	"text": "The beast lets out a harsh snarl, the rocky armor along its limbs gleaming dark green under the light. Each heavy breath rattles, and every step makes the ground tremble."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "I study its movements, trying to find a pattern. It moves fast despite its weight, stones scattering with every landing. My heartbeat grows louder in my ears."
  },
  {
	"text": "I think I see an opening and shout, “Alicia! Its left leg—” But before I can finish, the creature suddenly lunges in the opposite direction."
  },
  {
	"event": [
	  { "action": "hp_lost", "amount": 10 },
	  { "action": "shake", "target": "Player" },
	  { "action": "set_flag", "flag": "injuredByMonster1", "value": true }
	],
	"text": "I can’t dodge in time. The impact sends me crashing to the ground. My vision spins as leaves and dust whirl in front of me."
  },
  {
	"text": "In that instant, a streak of silver cuts through the air. Alicia charges forward, nearly brushing past the monster as her blade sweeps across its neck."
  },
  {
	"event": [
	  { "action": "shake", "target": "Monster1" },
	  { "action": "remove_character", "target": "Monster1" }
	],
	"text": "The beast releases a piercing shriek. Its body stiffens, then dissolves into ash. The smell of scorched earth spreads through the clearing."
  },
  {
	"text": "I lie on my back, chest heaving. Alicia rushes over and drops to one knee, checking me over with a frown. “What were you thinking? Creatures like this don’t move in ways you can predict unless you’ve fought for years.”"
  },
  {
	"text": "I struggle to answer. She sighs, her tone softening. “I’m not blaming you. Just… don’t try to figure everything out on your own. Leave it to me.”"
  },
  {
	"text": "She tears a strip of cloth and wipes the blood from my arm, her movements so gentle they’re almost silent. Her expression shifts from tension to something softer. “Does it hurt?”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“I can handle it.” I force a grin. “Next time I’ll be sure.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She presses her lips together, sounding faintly exasperated. “You just like to show off.”"
  },
  {
	"text": "The wind drifts through the trees. She glances at the scorched ground, her expression gradually returning to calm."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“It wasn’t born naturally. It’s a ‘Lingering Dream’—a trace left behind by those who died.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Lingering Dream?” I ask between breaths."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Yes. In places where wars were fought and people died, their final emotions sink into the earth. Over time, they become things like this.”"
  },
  {
	"text": "After a pause, she adds quietly, “Don’t scare me like that again. Alright?”"
  },
  {
	"text": "I blink, then grin faintly. “Is that concern?” She shoots me a look but doesn’t deny it. Instead, she reaches out and pulls me to my feet."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Come on. The market’s just ahead. When we’re back in town, I’ll find something to treat that.”"
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.5" }]
  }
]
