[
  {
	"event": [
	  { "action": "spawn_character", "target": "Alicia", "pos": [-450, 0] },
	  { "action": "show_talk_ui" }
	]
  },
  { "text": "The air finally settles. The hearth begins to flicker again, light and shadow glimmering faintly across her clothes." },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“That move just now… was it magic?”"
  },

  { "text": "She blinks, a faint smile forming at the corner of her lips." },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“No. The wind simply listens to me.”"
  },

  { "text": "The wind outside gradually fades, leaving only snowflakes tapping softly against the window frame. The inn returns to its usual quiet, with only the crackle of flames echoing in the air." },

  { "text": "I busy myself picking up the scattered cups. She walks over and bends down to help me lift a fallen table. Her fingers are steady, yet her movements carry a hint of unfamiliar gentleness." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Do you often face things like this alone? Drunks like that aren’t easy to deal with.”"
  },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“I’ve always been alone. Ever since I took over this place from my family.”"
  },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“You should hire someone to help you. At least you’d have someone to talk to and pass the time.”"
  },
  {
	"text": "She says this with a small shake of her head and a faint smile."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“People have to learn to let others lend a hand.”"
  },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“What about you? Would you let someone help you?”"
  },

  { "text": "She doesn’t answer, only smiles softly—the warmth in it veiled like something hidden behind years of mist." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“I’m a traveler.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Could you give me a room?”"
  },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“Of course.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“It’s quiet and by the window. At night you can see the northern snowlight.”"
  },

  { "text": "She nods and removes her cloak, revealing the sword etched with patterns—the hilt marked by a small crack." },
  { "text": "I notice that fracture. The firelight reflects off it like a wound that has yet to heal." },

  {
	"text": "“Damage doesn’t mean the end. It only reminds you that you once fought with everything you had.”"
  },

  { "text": "Her figure ascending the stairs is cut into streaks of gold by the firelight. Her footsteps echo along the wooden steps—clear and measured." },

  {
	"event": [{ "action": "remove_character", "target": "Alicia" }],
	"text": "The wind outside has long since stopped, but the snow begins to fall softly."
  },

  { "text": "I lower my gaze and see the brass die on the counter. It rolls half a turn on its own and stops, showing a “3.”" },
  { "text": "I frown and pick it up. —But I’m certain I didn’t touch it just now." },
  { "text": "I slip the die into my pocket, listening to the sound of snow outside. It’s gentle, yet it gives me a strange illusion: as if someone, long ago, had cast the very same die." },

  { "event": [{ "action": "change_scene", "target": "scene1.2" }] }
]
