[
  {
	"event": [
	  { "action": "spawn_character", "target": "Alicia", "pos": [450, 0] },
	  { "action": "show_talk_ui" }
	],
	"text": "The firelight flickers in her eyes, casting a soft ring of gold. Outside, the wind hums low, like an old song no one can quite remember."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“What about you? What would you want to change?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She pauses for a moment, her fingers tightening slightly, as if she hadn’t expected me to ask."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“I’ve asked myself that question countless times.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“But every time I try to rewrite something, the world reminds me—I no longer have the right.”"
  },
  {
	"text": "I don’t answer at once. The only sound is the crackle of burning wood, the firelight rising and falling with her voice."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Tell me,” she says softly, “if someone has once destroyed another’s fate, do they still deserve to rewrite their own?”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“…I don’t know.”"
  },
  {
	"text": "In that moment, any comfort feels meaningless. Her gaze lowers slightly, her lashes casting a faint shadow beneath the lamp."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“I used to believe I was saving people.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“But sometimes, salvation and destruction are only a single sentence apart.”"
  },
  {
	"text": "Her tone is gentle, yet edged with resolve. For the first time, I see that glimmer of sorrow in her eyes—not regret, but a weary reconciliation with fate."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“…It sounds like you’ve carried something very heavy.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Perhaps.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“But at least now, it won’t crush me anymore.”"
  },
  {
	"text": "Firelight brushes across her profile, revealing the faint trace of an old scar. She neither hides it nor explains."
  },
  {
	"text": "In that instant, I realize this woman is not unbreakable. She has simply grown used to holding herself together—even while falling apart."
  },
  {
	"text": "She sets down her glass and taps the wooden table twice with her fingers, as if marking the rhythm of some wandering thought."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“The wine tonight is quite good.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Compared to the warmed wine in the south, I suppose I’m better suited to something stronger.”"
  },
  {
	"text": "I say nothing, only refill her glass. The scent of wine mingles with the firelight, as if this brief confession is quietly sealed into the night."
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.4" }]
  }
]
