[
  {
	"event": [
	  { "action": "spawn_character", "target": "Junker", "pos": [450, 0] },
	  { "action": "spawn_character", "target": "Alicia", "pos": [-450, 0] }
	]
  },
  {
	"text": "I slowly moved my hand toward the short sword at my waist—but the scabbard brushed against the buckle with a faint metallic ‘clang’."
  },
  {
	"text": "The drunkard whipped his head around, bloodshot eyes locking onto me."
  },
  {
	"event": [{ "action": "show_name", "target": "Junker" }],
	"text": "“What the hell do you think you’re doing?!”"
  },
  {
	"text": "His rage flared instantly. He slammed his fist onto the table, sending the spilled liquor flying."
  },
  {
	"event": [{ "action": "show_name", "target": "Junker" }],
	"text": "“You dare draw your sword?!”"
  },
  {
	"text": "I instinctively took a step back, hand half-curled around the hilt. The air between us thickened—like the moment before a spark meets powder."
  },
  {
	"text": "Just as he lunged forward, a sound cut through the air—not wind, but the clear ring of steel."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "Alicia was already on her feet. Her cloak swept past the hearth, and a flash of silver lit the room."
  },
  {
	"text": "No one saw what she did. In the next heartbeat, the drunk was face-down on the floor, his head buried in his own spilled drink.",
	"event": { "action": "shake", "target": "Junker" }
  },
  {
	"text": "I stood frozen, staring at her. Only then did I realize—I’d never needed to draw my sword at all."
  },
  {
	"event": { "action": "remove_character", "target": "Junker" },
	"text": "She withdrew her blade. The firelight shimmered faintly along the cracked edge of the steel."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“You were a step too slow.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“Looks like you didn’t need any help.”"
  },
  {
	"text": "Alicia lifted her eyes slightly. The firelight flickered in them—half amusement, half something else."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Maybe.”"
  },
  {
	"text": "She slid the sword back into its sheath, the soft rasp of metal filling the quiet room."
  },
  {
	"text": "The air moved again; the fire crackled, and a few patrons peeked out before hastily returning to their seats."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Clean this up. No need to invite the town guards here.”"
  },
  {
	"text": "Her tone carried no command—just calm statement of fact."
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“All right.”"
  },
  {
	"text": "I nodded and picked up a rag, wiping away the spilled wine. She stood quietly beside me—waiting, perhaps, or lost in thought."
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.1" }]
  }
]
