[
  {
	"event": [
	  { "action": "spawn_character", "target": "Alicia", "pos": [450, 0] },
	  { "action": "show_talk_ui" }
	],
	"text": "The flames flicker softly, and the air carries the scent of wine and burning wood. She watches me quietly, as if waiting for an answer."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“I’ll keep running the inn and go on with my life as usual,” I say with a smile. “If fate wants to change, it can change on its own.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She pauses, seemingly caught off guard by my response. Then a faint smile curves her lips. “You’re surprisingly open-minded.”"
  },
  {
	"text": "There is no mockery in her smile—only a hint of admiration. For a moment, she no longer seems like a wandering traveler, but someone listening to a long-lost comfort."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Sometimes, maintaining the ordinary takes more courage than trying to change fate,” she sighs softly. “I’ve seen too many souls who wanted to start over, and not one of them found true peace.”"
  },
  {
	"text": "Her tone carries a rare gentleness, like wind sweeping across a snowy plain—light, yet leaving a trace behind."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“What about you?” I ask. “Do you want to start over?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She falls silent for a few seconds, then shakes her head slightly. “I’m not sure anymore. Maybe… I’m just too tired. If I could choose, perhaps I would simply follow fate.”"
  },
  {
	"text": "Firelight brushes across her profile, her gaze drifting within the shifting glow. Her smile feels as though it has drifted from a distant past, carrying a tenderness she has never fully let go."
  },
  {
	"text": "And suddenly, I realize—the ‘souls’ she spoke of might include herself."
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.4" }]
  }
]
