[
  {
	"branch": "B_fail",
	"event": [
	  { "action": "spawn_character", "target": "Monster1", "pos": [-450, 0] },
	  { "action": "spawn_character", "target": "Alicia", "pos": [450, 0] },
	  { "action": "show_talk_ui" }
	],
	"text": "The beast let out a low growl and leapt from the bushes. The ground trembled, and dry leaves scattered into the air."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "Instinctively, I raised my backpack to block—but the creature’s strength was far greater than I expected. The next instant, I was thrown backward, crashing hard onto the ground."
  },
  {
	"event": [
	  { "action": "hp_lost", "amount": 10 },
	  { "action": "shake", "target": "Player" },
	  { "action": "set_flag", "flag": "injuredByMonster1", "value": true }
	],
	"text": "Pain exploded in my chest like a rock had struck it. My breath caught. The beast’s claws shredded my pack, scattering torn fabric and dust."
  },
  {
	"text": "Before I could get up, a low snarl echoed near my ear. Alicia darted forward, a flash of silver slicing through the air—her blade cleaved the monster down, reducing it to ashes."
  },
  {
	"event": [{ "action": "remove_character", "target": "Monster1" }],
	"text": "The air reeked of burnt flesh and iron. Firelight danced on the edge of her sword."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Hey!” Her voice was sharper than usual. Before I could respond, she was already beside me, half kneeling. “Are you hurt? Talk to me.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "I coughed and forced a weak smile. “I’m fine... probably just got hit.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She frowned, her hand still gripping my shoulder. “You sure? Don’t push yourself.”"
  },
  {
	"text": "Her expression was tight and serious—so unlike her usual calm. Only after confirming I could sit upright did she exhale softly, relaxing a little."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Next time, don’t try to take the hit, got it?”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "I nodded. Though her tone was even, her hand still gave my arm a light pat—as if to make sure I was really still alive."
  },
  {
	"text": "The forest fell silent again, save for the scorched marks on the ground. Alicia looked toward the burned earth, her voice lowering slightly."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“These creatures aren’t natural. They’re ‘Residual Dreams’—echoes left behind by the dead.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Residual Dreams?” I repeated, still short of breath."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Mm. In places touched by war or death, the earth absorbs the last emotions of the fallen. Over time, those emotions take form.”"
  },
  {
	"text": "She glanced at me again, her tone softening. “You really scared me just now.”"
  },
  {
	"text": "She reached out to help me up, brushing the dust off my back. Her smile was faint—but warmer than the firelight."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Can you walk?”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "I flexed my arm and nodded. “I can.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She smiled gently. “Good. Let’s go. The market’s just ahead—we’ll patch you up there.”"
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.5" }]
  }
]
