[
  {
	"event": [
	  { "action": "set_background", "target": "underground_entrance" },
	  { "action": "spawn_character", "target": "Lucia", "pos": [-450, 0] },
	  { "action": "spawn_character", "target": "EnemyLeader", "pos": [450, 0] },
	  { "action": "show_talk_ui" }
	],
	"text": "The air turned rigid. The chanting stopped abruptly, and several gazes gathered beneath the shadows—cold, distorted, and filled with fanatic malice. The ritual’s blue light flickered across the ground like an awakening eye."
  },
  {
	"event": [
	  { "action": "remove_character", "target": "Lucia" },
	  { "action": "spawn_character", "target": "Enemy1", "pos": [-450, 0] },
	  { "action": "show_talk_ui" }
	],
	"text": "I didn’t hesitate. My foot slammed into the ground, snow and dust scattering as my blade flashed silver in my hand."
  },
  {
	"text": "The robed cultists clearly hadn’t expected a direct assault. Two of them hurriedly raised their hands, blue light gathering between their palms."
  },
  {
	"event": { "action": "shake", "target": "Enemy1" },
	"text": "I ducked beneath the spell’s glow—sparks burst overhead—and in the same instant, my blade drove straight into one man’s chest."
  },
  {
	"event": { "action": "show_name", "target": "Enemy1" },
	"text": "“Urgh—!”"
  },
  {
	"event": [
	  { "action": "remove_character", "target": "Enemy1" },
	  { "action": "spawn_character", "target": "Lucia", "pos": [-450, 0] }
	],
	"text": "Blood splattered across the glowing sigils, and the blue light wavered violently. The chant broke off, and the air itself crackled like shattering glass."
  },
  {
	"event": { "action": "show_name", "target": "Lucia" },
	"text": "“Nice one!”"
  },
  {
	"text": "Lucia shouted, raising her staff as a beam of light slammed into another cultist. The blue barrier shattered instantly."
  },
  {
	"event": { "action": "show_name", "target": "EnemyLeader" },
	"text": "“Stop them! The ritual must not fail!”"
  },
  {
	"text": "The leader roared, weaving a new spell as the sigils beneath him flared back to life. I seized the moment, lunging forward—my blade met his glowing talisman with a sharp clang."
  },
  {
	"event": { "action": "shake", "target": "Player" },
	"text": "The clash of steel and energy rattled my skull, but his charm cracked apart. The backlash surged—blue light spiraling wildly."
  },
  {
	"text": "I staggered, blood pounding in my ears, yet the chains at the array’s core had already begun to loosen."
  },
  {
	"event": { "action": "show_name", "target": "Lucia" },
	"text": "“Now!”"
  },
  {
	"text": "Lucia’s final incantation lit the chamber. The glowing chains snapped, sparks bursting outward. Alicia’s body fell from the pillar—Lucia caught her just in time."
  },
  {
	"event": { "action": "show_name", "target": "EnemyLeader" },
	"text": "“No—!”"
  },
  {
	"text": "The cult leader tried to reform his seals, but I was already there. My boot crashed into his chest, blue sigils exploding as he was hurled against the wall."
  },
  {
	"text": "The ritual’s glow flickered chaotically, runes on the walls fracturing one by one. The low hum turned into a thunderous collapse."
  },
  {
	"event": [{ "action": "remove_character", "target": "EnemyLeader" }],
	"text": "After one violent pulse of energy, the cult leader’s form was swallowed by the collapsing light—gone without a trace."
  },
  {
	"text": "The rumble faded. Dust and the stench of burnt stone filled the air as debris smoldered across the floor."
  },
  {
	"text": "I pushed myself up, breathing hard, my blade still slick with blood. I lifted Alicia in my arms—her skin pale beneath the soot."
  },
  {
	"event": [
	  { "action": "show_name", "target": "Lucia" },
	  { "action": "spawn_character", "target": "Alicia", "pos": [450, 0] }
	],
	"text": "“She’s alive—her pulse is weak, but she’s still here!”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“We have to move! This place is going to collapse!”"
  },
  {
	"text": "I led the way, shoving aside broken stones as we pushed toward the exit."
  },
  {
	"event": [{ "action": "set_background", "target": "Street" }],
	"text": "Cold night air struck my face as we stumbled out. Snowflakes stung my skin like needles. The faint glow of street lamps flickered in the distance."
  },
  {
	"event": { "action": "show_name", "target": "Lucia" },
	"text": "“That strike… it was perfect.”"
  },
  {
	"text": "Her eyes held both shock and admiration."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“She taught me that.”"
  },
  {
	"text": "I looked down at Alicia in my arms, lips curling into a faint, weary smile. “Guess I finally managed to repay the favor.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“…Thank you…”"
  },
  {
	"text": "Alicia’s voice was barely a whisper, light as breath. Her lashes trembled, then stilled as she drifted back into unconsciousness."
  },
  {
	"event": { "action": "show_name", "target": "Lucia" },
	"text": "“What did she say?”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“That she’s alive—and that’s enough.”"
  },
  {
	"text": "I looked up at the night sky above the northern district. The wind scattered the snow, and the town’s bell tolled softly in the distance."
  },
  {
	"text": "In that moment, I understood—this fight was far from over. Heat pulsed faintly in my palm, where the ritual’s light had touched me—the faintest trace of blue still glimmering beneath the skin."
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.7" }]
  }
]
