[
  {
	"event": [
	  { "action": "spawn_character", "target": "Junker", "pos": [450, 0] },
	  { "action": "spawn_character", "target": "Alicia", "pos": [-450, 0] }
	]
  },
  {
	"text": "I choose to remain silent, gripping the counter tightly as I observe how the situation unfolds."
  },
  {
	"text": "The drunk’s emotions, however, flare up like oil thrown onto a fire."
  },
  {
	"text": "He suddenly grabs a bottle and smashes it hard against the floor. Shards and wine scatter everywhere, and the impact forces me to stumble back two steps."
  },
  {
	"text": "The crowd cries out. The hearth shudders. The stench of alcohol mixed with dust hits me in the face, making me cough."
  },
  {
	"text": "The drunk’s fist is already raised—"
  },
  {
	"text": "At that very instant, the wind outside roars in, extinguishing half the firelight."
  },
  {
	"text": "The cloaked woman’s gaze is calm and sharp. With a lift of her hand, both the shards and the wind freeze in midair."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Enough.”"
  },
  {
	"text": "The drunk stiffens in place, his face turning deathly pale, a hoarse breath rasping from his throat."
  },
  {
	"text": "His eyes stop on the emblem at the woman’s chest, his pupils suddenly widening."
  },
  {
	"text": "After a moment of silence, he seems to realize something. His lips tremble, his breathing thrown into disarray."
  },
  {
	"event": { "action": "show_name", "target": "Junker" },
	"text": "“You… you’re—”"
  },
  {
	"text": "Before he can finish, it is as if some invisible force strikes him, and he staggers backward."
  },
  {
	"event": [{ "action": "shake", "target": "Junker" }],
	"text": "He turns in panic and practically tumbles out the door in his haste to escape."
  },
  {
	"event": [{ "action": "remove_character", "target": "Junker" }],
	"text": "The door is slammed shut by the wind with a heavy bang. The tavern sinks back into silence, with only the faint whisper of snow slipping through the cracks."
  },
  {
	"event": { "action": "hp_lost", "amount": 10 },
	"text": "I remain leaning against the counter, my chest rising unevenly. A shallow cut runs across the back of my hand, the blood gleaming in the firelight."
  },
  {
	"text": "She glances at me. Her gaze is light as the wind, yet carries a power that is hard to meet directly."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Next time, be quicker on your feet. You saw the bottle—why didn’t you dodge?”"
  },
  {
	"text": "Her tone is mild as she says it, sounding almost like a reprimand, yet tinged with faint teasing."
  },
  {
	"text": "I freeze for a moment. Before I can think of a response, she has already walked to the door."
  },
  {
	"text": "The wind rushes in. She pauses, lifting her hand to gently push the door shut."
  },
  {
	"text": "“The wind outside has stopped,” she says, turning her head to look at me. “You can catch your breath now.”"
  },
  {
	"text": "She does not leave. Instead, she leans lightly by the door, as if making sure everything has truly ended."
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.1" }]
  }
]
