[
  {
	"event": [
	  { "action": "spawn_character", "target": "Monster1", "pos": [-450, 0] },
	  { "action": "spawn_character", "target": "Alicia", "pos": [450, 0] },
	  { "action": "show_talk_ui" }
	],
	"text": "The beast lets out a low snarl and bursts from the undergrowth. The ground trembles as dead leaves scatter into the air."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "I instinctively raise my pack to shield myself, but the creature’s strength far exceeds what I expected. In the next instant, I’m thrown backward, hitting the ground hard."
  },
  {
	"event": [
	  { "action": "hp_lost", "amount": 10 },
	  { "action": "shake", "target": "Player" },
	  { "action": "set_flag", "flag": "injuredByMonster1", "value": true }
	],
	"text": "Pain explodes across my chest like a stone crushing down. My breath catches. The pack is torn open by its claws, scraps of cloth and dust flying everywhere."
  },
  {
	"text": "Before I can scramble up, a sharp sound slices through the air. Alicia charges forward—silver light flashes—and the monster is cut down in a single stroke, dissolving into ash."
  },
  {
	"event": [
	  { "action": "remove_character", "target": "Monster1" }
	],
	"text": "The air fills with the scent of scorch and blood. Firelight flickers along her blade."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Hey!” Her voice is sharper than usual. Before I can answer, she’s at my side, kneeling and pulling me upright. “Are you hurt? Talk to me.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "I cough, forcing a weak smile. “I’m… fine. Just got knocked around.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She frowns, her hand still gripping my shoulder. “Are you sure? Don’t pretend.”"
  },
  {
	"text": "Her expression is tight and serious—nothing like her usual calm detachment. Only after she’s certain I can sit upright does she slowly release her hold, exhaling softly."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Next time, don’t try to take it head-on. Understood?”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "I nod. Though her tone is steady, she pats my arm lightly, as if reassuring herself that I’m still alive."
  },
  {
	"text": "The forest falls quiet again. Only a scorched mark remains where the creature stood. Alicia looks at the blackened earth, her voice lowering."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“These things aren’t born naturally. They’re ‘Lingering Dreams’—traces left behind by those who died.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Lingering Dreams?” I repeat, still catching my breath."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Yes. In places where battles were fought and people died, their final emotions seep into the ground. Given time, they become creatures like this.”"
  },
  {
	"text": "After a pause, she glances back at me, her voice softening. “You really scared me just now.”"
  },
  {
	"text": "She offers her hand to help me up, brushing dust from my back. Her smile is faint—but warmer than the firelight."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Can you walk?”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "I move my arm carefully and nod. “Yeah. I can.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She smiles slightly. “Good. The market’s just ahead. Let’s get that looked at.”"
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.5" }]
  }
]
