[
  {
	"event": [
	  { "action": "spawn_character", "target": "Alicia", "pos": [450, 0] },
	  { "action": "show_talk_ui" }
	],
	"text": "Firelight sways along the walls, and the night wraps the entire inn in a quiet layer of gold. Her gaze rests on me, carrying a faint trace of inquiry."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“I will try to change fate,” I say. My voice is calm, yet firmer than I expected."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She pauses, as if not expecting that answer. The firelight reflects in her eyes, and for a brief moment, a gentle smile flickers there."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Perhaps you really can,” she says softly. “Some people negotiate with fate instead of being led by it.”"
  },
  {
	"text": "She lifts her glass but does not drink, only watching the light ripple across the surface. In that instant, she seems softened by the flames."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“I’ve seen too many crushed beneath fate,” her voice lowers. “But I’ve also seen—someone rise before it, smiling.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Are you talking about yourself?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She hesitates for a moment, then laughs softly, a hint of helplessness in her tone. “Me? I haven’t beaten it yet.”"
  },
  {
	"text": "The fire flickers. Outside, the faint sound of snow falling drifts in. There is a trace of bitterness in her smile, but it no longer feels distant."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“If that day ever comes…” she says, “I hope you won’t regret it. The chances fate gives always demand a price.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“And you?” I ask quietly. “Do you regret it?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She doesn’t answer. She simply raises her glass and drains it in one swallow. The liquid catches the firelight like molten amber."
  },
  {
	"text": "“Fate is stubborn,” she says gently as she sets the glass down, smiling at me. “But perhaps—you’ll be the exception.”"
  },
  {
	"text": "Flames dance in her eyes, light and shadow intertwining. Her smile lingers in the night for a long while."
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.4" }]
  }
]
