[
  {
	"event": [
	  { "action": "hide_talk_ui" },
	  { "action": "unlock","target": "1_8" },
	  { "action": "set_background", "target": "tavern_night" }
	]
  },
  {
	"event": { "action": "show_talk_ui" },
	"text": "The night air is thick as ink. The wind carries the smell of scorched grass from the direction of the north gate—the scent that only appears when monsters draw near: metal, blood, rot."
  },
  {
	"text": "I lean behind the counter as the firelight in the hearth slowly dims. Distant hoofbeats echo outside, as if something is fleeing. Then it hits me—the sky is already dark, and Alicia hasn’t returned. Lucia isn’t here either."
  },
  {
	"text": "I walk to the window. The street is empty, wind spiraling snow at the mouth of the alley. The tavern’s lamplight reflects in the glass like two lonely eyes. Before leaving, she said only one thing: No matter what you hear tonight, do not go outside."
  },
  {
	"text": "I open the drawer and feel the short sword and the charm. She said it would keep me dreamless for one night. But I can’t sleep."
  },
  {
	"text": "The wind grows louder, like something roaring beyond the city walls. The building trembles faintly, dust drifting from the beams. I step to the door. A gust of hot air pushes through the crack, tinged with the scent of blood. My hand grips the handle, my palm burning."
  },
  {
	"text": "Her voice echoes in my ears: Don’t go outside. It takes all my strength to let go."
  },
  {
	"text": "The horizon flares once, then fades—a brightness that does not belong to this world."
  },
  {
	"event": { "action": "set_background", "target": "Black" },
	"text": "I don’t know how long the battle lasted. At last, the wind dies down. The street corner falls silent. The northern sky glows faintly red."
  },
  {
	"event": { "action": "set_background", "target": "Street" },
	"text": "I push the door open. Night clings like burnt ash. There is no one on the street, and no sign of Lucia. Only the wind slowly thinning the scent of blood."
  },
  {
	"text": "I stand at the doorway for a long time. Snow begins to fall—fine and cold. Half-buried in the snow at my feet lies something familiar—the brass die."
  },
  {
	"text": "It still holds a trace of warmth. I pick it up and wipe away the bloodstain. The die rolls once in my palm and slowly stops—“3.” The world falls silent, even the wind seeming to hold its breath."
  },
  {
	"event": { "action": "set_background", "target": "tavern_night" },
	"text": "I return behind the counter and sit down. The fire is out. Snow continues to fall outside the window. That night, I never slept again—and I never saw them return."
  },
  {
	"event": { "action": "change_scene", "target": "scene2.0" }
  }
]
