[
  {
	"event": [
	  { "action": "hide_talk_ui" },
	  { "action": "set_background", "target": "tavern_night" }
	]
  },
  {
	"event": { "action": "show_talk_ui" },
	"text": "The night air was thick as ink. A burnt, metallic scent drifted in from the north gate—the unmistakable stench that came with monsters: iron, blood, and rot."
  },
  {
	"text": "I leaned behind the counter. The fire in the hearth was dying, its glow fading to embers. From afar came the sound of hooves—fleeing, not charging. Then it struck me: it was already dark. Alicia hadn’t returned. Lucia was gone too."
  },
  {
	"text": "I went to the window. The street outside was empty, the wind swirling snowflakes through the alleys. The inn’s lights reflected dimly in the glass—two lonely eyes in the dark. Before she left, Alicia said only one thing: *Don’t go outside tonight, no matter what you hear.*"
  },
  {
	"text": "I opened the drawer and felt for the short sword—and the charm. She said it would ‘keep me dreamless for one night.’ But I couldn’t sleep at all."
  },
  {
	"text": "The wind grew stronger, carrying the roar of something beyond the walls. The house trembled; dust drifted from the beams. I walked to the door. A blast of hot air rushed through the crack—thick with blood. My hand tightened around the handle, burning hot."
  },
  {
	"text": "Her voice still echoed in my head: *Don’t go outside.* I forced myself to let go."
  },
  {
	"text": "A flash lit the horizon—then vanished. That kind of light didn’t belong to this world."
  },
  {
	"event": { "action": "set_background", "target": "Black" },
	"text": "I didn’t know how long the battle lasted. When the wind finally ceased, the streets were silent. To the north, the sky faintly glowed red."
  },
  {
	"event": { "action": "set_background", "target": "Street" },
	"text": "I opened the door. The air outside was heavy with ash and burnt snow. No people. No Lucia. Only the wind, thinning the scent of blood with every gust."
  },
  {
	"text": "I stood there for a long time. Snow began to fall—thin, cold. Something half-buried at my feet caught the light: a brass die."
  },
  {
	"text": "It was still warm. I picked it up, wiped the blood away. The die rolled once in my palm, then stopped—‘3.’ The world went utterly still. Even the wind seemed to hold its breath."
  },
  {
	"event": { "action": "set_background", "target": "tavern_night" },
	"text": "I sat back behind the counter. The fire was out. Outside, snow kept falling. That night, I didn’t sleep. And they never came back."
  },
  {
	"event": { "action": "change_scene", "target": "scene2.0" }
  }
]
