[
  {
	"branch": "C_fail",
	"event": [
	  { "action": "spawn_character", "target": "Monster1", "pos": [-450, 0] },
	  { "action": "spawn_character", "target": "Alicia", "pos": [450, 0] },
	  { "action": "set_background", "target": "forest_path" },
	  { "action": "show_talk_ui" }
	],
	"text": "The monster roared, the rocky plates on its limbs glinting faintly green under the light. Each step it took made the ground tremble."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "I watched its movements carefully, trying to find a pattern. It was fast and heavy, scattering pebbles with every step. My heartbeat quickened."
  },
  {
	"text": "I thought I saw an opening and shouted, “Alicia! Its left leg—” But before I could finish, the beast lunged the other way."
  },
  {
	"event": [
	  { "action": "hp_lost", "amount": 10 },
	  { "action": "shake", "target": "Player" },
	  { "action": "set_flag", "flag": "injuredByMonster1", "value": true }
	],
	"text": "I couldn’t dodge in time. The force of the blow sent me sprawling. The world spun as leaves and dirt filled my vision."
  },
  {
	"text": "Then, in a flash of silver, Alicia surged forward, brushing past the creature as her blade cut cleanly across its neck."
  },
  {
	"event": [
	  { "action": "shake", "target": "Monster1" },
	  { "action": "remove_character", "target": "Monster1" }
	],
	"text": "The beast let out a shrill screech, stiffened, and then crumbled to ash. The scent of scorched earth hung heavy in the air."
  },
  {
	"text": "Flat on my back, I gasped for breath. Alicia hurried over, kneeling beside me with a frown. “What were you thinking? A monster like this—only a seasoned fighter can predict its moves.”"
  },
  {
	"text": "I couldn’t find words. She sighed, her tone softening. “It’s fine. I’m not blaming you. Just… don’t try to handle it alone next time. Leave it to me.”"
  },
  {
	"text": "She tore a strip of cloth and gently wiped the blood from my arm, her movements quiet and precise. Her expression softened as she murmured, “Does it hurt?”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“I can handle it.” I grinned. “Next time, I’ll get it right.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She pressed her lips together, sounding half helpless, half amused. “You just can’t help showing off.”"
  },
  {
	"text": "The wind rustled through the forest as she looked toward the scorched earth, her expression gradually calming."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“It’s not a natural creature. It’s a ‘Residual Dream’—a trace left behind by the dead.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Residual Dream?” I asked between breaths."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Yes. In places where wars were fought and people died, the ground keeps their final emotions. Over time, those emotions take shape.”"
  },
  {
	"text": "Then she added softly, “Don’t scare me like that again, alright?”"
  },
  {
	"text": "I blinked, then chuckled. “Was that… concern?” She shot me a glare but didn’t answer, instead offering me her hand."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Come on. The market’s just ahead,” she said. “We’ll get you some medicine once we’re back in town.”"
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.5" }]
  }
]
