[
  {
	"event": [
	  { "action": "spawn_character", "target": "Junker", "pos": [450, 0] },
	  { "action": "spawn_character", "target": "Alicia", "pos": [-450, 0] }
	]
  },
  {
	"text": "I took a deep breath, steadying my voice."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Friend, she’s just a traveler passing through. If you want a drink, it’s on me.”"
  },
  {
	"text": "The drunkard froze for a moment. The cracked bottle in his hand wobbled twice, and wine trickled down its neck, dripping onto the counter."
  },
  {
	"text": "His gaze drifted between me and the woman. The anger on his lips slowly faded, leaving only the weariness of a man long drowned in drink."
  },
  {
	"text": "I sighed quietly."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“If you keep causing trouble, I’ll have to call the town guard.”"
  },
  {
	"text": "The drunkard muttered something under his breath, a half-hearted curse."
  },
  {
	"event": { "action": "show_name", "target": "Junker" },
	"text": "“Hmph... lousy tavern.”"
  },
  {
	"text": "He staggered toward the door, his boots scraping across the floor with a harsh, dragging sound. The wind seeped in, carrying a chill scent of snow."
  },
  {
	"event": [{ "action": "remove_character", "target": "Junker" }],
	"text": "He kicked the door open and slammed it shut behind him, the frame trembling from the impact. Moments later, only the whisper of snow remained. The tavern fell silent once more."
  },
  {
	"text": "I exhaled deeply, realizing my back was soaked with cold sweat. The fire crackled again, and the shifting light returned to the walls."
  },
  {
	"text": "She stood where she was, her gaze resting quietly on me. It was a look hard to describe—part approval, part assessment."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“You handled that well.”"
  },
  {
	"text": "I gave a faint smile, wiping the spilled wine from the table."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Just doing my part.”"
  },
  {
	"text": "She nodded slightly, her expression calm."
  },
  {
	"text": "The firelight reflected softly on her face—the chill in her features seemed to ease, just a little."
  },
  {
	"text": "Then I noticed her hands—slender, long-fingered, but marked with faint calluses that no traveler should bear."
  },
  {
	"text": "Curiosity stirred in me, but I held my tongue. The air began to move again, as if nothing had happened, leaving only the sound of wood crackling in the hearth."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "Her gaze lingered on me, her voice low and even."
  },
  { "text": "“What’s your name?”" },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "I blinked, then answered without thinking."
  },
  { "text": "“My name is... Ryan.”" },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She nodded lightly."
  },
  { "text": "“I’ll remember that.”" },
  {
	"event": { "action": "hide_name" },
	"text": "She said nothing more, just took a seat by the fire, removing her cloak as snowflakes slid down the fabric’s edge."
  },
  {
	"text": "Leaning back in the chair, she closed her eyes for a moment and let out a long breath—at that moment, she no longer looked like a traveler, but simply a weary human being."
  },
  {
	"text": "I watched her, and a strange feeling crept over me—as if all of this had been destined from the very beginning."
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.1" }]
  }
]
