[
  {
	"branch": "A_success",
	"event": [
	  { "action": "spawn_character", "target": "Monster1", "pos": [-450, 0] },
	  { "action": "spawn_character", "target": "Alicia", "pos": [450, 0] },
	  { "action": "show_talk_ui" }
	],
	"text": "The ground trembled violently as a rock-armored beast burst from beneath the soil. Its glowing green eyes sent the birds scattering in terror."
  },
  {
	"text": "I rolled to the side, gravel crunching beneath my boots. The beast’s claws scraped past my shoulder, striking sparks against the stones."
  },
  {
	"text": "My breath turned to frost. Just as I steadied myself, Alicia’s silhouette flashed through the air—her cloak cutting an arc, her sword following like silver lightning."
  },
  {
	"event": [{ "action": "shake", "target": "Monster1" }],
	"text": "A sharp gleam slashed across the monster’s chest, forcing it back several steps with a guttural snarl."
  },
  {
	"text": "I spotted a crack in its armor and shouted, “Its right side—there’s a breach in the shell!”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“I see it.” Her voice was steady, movements clean and precise. Her sword cut through the air, leaving a cold streak of light behind."
  },
  {
	"event": [{ "action": "shake", "target": "Monster1" }],
	"text": "The beast froze, the green glow in its eyes fading. A moment later, it collapsed with a heavy crash, its cracked armor scattering dirt and dust."
  },
  {
	"event": [{ "action": "remove_character", "target": "Monster1" }],
	"text": "The air filled with smoke and the scent of burnt earth. Alicia sheathed her sword and turned toward me."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Not bad,” she said calmly, though her lips curved slightly. “Next time, stay a bit farther back.”"
  },
  {
	"text": "I nodded, palms slick with sweat—but my heart raced with a strange excitement. I had survived… and even helped."
  },
  {
	"event": [{ "action": "set_background", "target": "forest_afterbattle" }],
	"text": "Scorch marks still stained the ground where the beast fell. The smell of smoke lingered, and sunlight filtered through the trees, glinting off her blade—cold as ice."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“That thing wasn’t born naturally,” she murmured. “It was a ‘Residual Dream’—the trace left behind by the dead.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Residual Dream?” I repeated, my voice still trembling."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Yes. In places scarred by war or death, the earth keeps the last emotions of the fallen. Over time, those emotions take shape.”"
  },
  {
	"text": "She sheathed her sword completely, her expression calm again. The wind swept through the trees, carrying away the smell of blood."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Come on,” she said with a faint smile. “The market’s just ahead—and I’ll be needing your help to carry a few things.”"
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.5" }]
  }
]
