[
  {
	"event": [
	  { "action": "set_background", "target": "tavern_out" },
	{ "action": "unlock","target": "1_7" },
	  { "action": "show_talk_ui" }
	],
	"text": "The sun was warm and bright. The town square was livelier than usual—children selling flowers, merchants shouting as the wind carried their voices away."
  },
  {
	"text": "I sat on the wooden steps outside the inn, watching the fountain at the square’s center. The water shimmered in the sunlight, as if nothing had ever happened."
  },
  {
	"event": [
	  { "action": "show_name", "target": "Alicia" },
	  { "action": "spawn_character", "target": "Lucia", "pos": [-450, 0] }
	],
	"text": "Alicia had changed into a simple light-colored dress, her silver hair tied loosely behind her—no armor, no sword."
  },
  {
	"text": "“A rare morning,” she said with a smile. “I thought I’d try living like an ordinary person, just for once.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Even heroes take days off?” I chuckled."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Sometimes we must,” she replied, sitting beside me and gazing at the children across the square. “Otherwise, we forget who we are.”"
  },
  {
	"event": [
	  { "action": "set_background", "target": "Square" }
	],
	"text": "We went to the bakery by the gate. The old shopkeeper paused when he saw her, then smiled and handed her two sweet buns. “For saving my grandson last time. I never got to thank you properly.”"
  },
  {
	"text": "“Then I’ll take them today,” she said with a grin, handing one to me."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“I didn’t save anyone.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“But you’re sharing breakfast with me.”"
  },
  {
	"text": "The bun was almost too sweet, yet it carried a strange comfort. The sunlight caught on her eyelashes, glinting softly. In that moment, she looked less like a warrior—and more like a traveler."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“If there were no monsters,” I asked suddenly, “would you stay here?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She paused, fingers brushing the edge of the paper bag. “I’ve thought about that. But I don’t belong here.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“By ‘here,’ you mean this town—or this world?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She smiled faintly after a moment of silence. “Maybe… time itself.”"
  },
  {
	"text": "We left the bakery. The chimes above the door sang in the wind; children chased pigeons down the street. She stopped briefly at a flower stand, eyes lingering on a bouquet of white hyacinths—then shook her head."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“I used to like flowers,” she said softly. “But now, every time I see them bloom, I think—they all live longer than I do.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Don’t say that.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“It’s just the truth.” She smiled again. “But today, I want to pretend I still believe—I’m alive.”"
  },
  {
	"text": "Her voice was so quiet, as if afraid to disturb the tenderness of the moment. I said nothing—just walked beside her in silence."
  },
  {
	"text": "The bell from the square rang in the distance. She looked up at the sky, then adjusted her cloak lightly."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“I’m going to check the barrier at the north gate.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Now?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Just to make sure.” Her expression turned serious. “Listen—tonight, no matter what happens, don’t go outside.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Why?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She didn’t answer. Instead, she lifted her hand and traced a faint mark in the air before my chest. A shimmer of light hung there, like dust caught in sunlight."
  },
  {
	"text": "“A charm,” she said with a smile. “It’ll grant you one night of dreamless sleep.”"
  },
  {
	"event": [
	  { "action": "remove_character", "target": "Alicia" }
	],
	"text": "She picked up her basket and disappeared into the crowd. Her silver hair glimmered in the sunlight until it vanished at the far end of the market."
  },
  {
	"text": "The wind shifted from the north, carrying a chill that didn’t belong. The fountain’s water suddenly arced higher than usual."
  },
  {
	"text": "I looked up. The sky was clear—yet a faint dark shape flickered briefly among the clouds."
  },
  {
	"text": "A shiver crawled down my spine. But then the laughter of children and the merchants’ shouts swallowed everything again. The sunlight remained gentle."
  },
  {
	"text": "I let out a slow breath, but the feeling lingered—that something was quietly drawing near."
  },
  {
	"event": [
	  { "action": "change_scene", "target": "scene1.8" }
	]
  }
]
