[
  {
	"event": [
	  { "action": "spawn_character", "target": "Alicia", "pos": [-450, 0] },
	  { "action": "show_talk_ui" }
	]
  },
  {
	"text": "The air finally settled. The fire crackled back to life, and the flickering light danced softly across her clothes."
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“That move just now... was it magic?”"
  },
  {
	"text": "She blinked, a faint smile tugging at the corner of her lips."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“No. The wind just listens when I speak.”"
  },
  {
	"text": "Outside, the wind gradually quieted. Only snowflakes brushed gently against the windowpanes. The inn returned to its usual calm, with nothing but the soft crackle of the fire filling the air."
  },
  {
	"text": "As I picked up the fallen cups, she came over and knelt beside me to lift the overturned table. Her hands were steady—her movements carried an unfamiliar gentleness."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Do you often handle things like this on your own? Drunks like that can be trouble.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“I’ve always been alone. Ever since I took over this place from my family.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“You should hire someone to help. It’s good to have company to talk to.”"
  },
  {
	"text": "She smiled and shook her head lightly."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“People need to learn when to let others lend a hand.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“And you? Do you ever let anyone help you?”"
  },
  {
	"text": "She didn’t answer—only smiled again, softly, as if through the mist of time."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“I’m a traveler.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Could you spare me a room?”"
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“Of course.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“This one’s quiet, near the window—you can see the northern snowlight at night.”"
  },
  {
	"text": "She nodded and unclasped her cloak, revealing the sword at her side—its hilt marked by a thin crack along the guard."
  },
  {
	"text": "I noticed the flaw. In the firelight, it glimmered faintly—like a wound that had never quite healed."
  },
  {
	"text": "“Damage doesn’t mean it’s broken,” I murmured. “It just reminds you that you once fought.”"
  },
  {
	"text": "She turned toward the stairs. The firelight traced her silhouette in thin lines of gold. Her footsteps echoed softly on the wooden steps—measured and calm."
  },
  {
	"event": [{ "action": "remove_character", "target": "Alicia" }],
	"text": "Outside, the wind had died, but the snow had begun to fall again—quiet and slow."
  },
  {
	"text": "I looked down and saw a brass die lying on the counter. It rolled half a turn on its own before stopping—face up on a three."
  },
  {
	"text": "I frowned, picking it up. I was certain—I hadn’t touched it just now."
  },
  {
	"text": "I slipped the die into my pocket and listened to the snow outside. The sound was soft, almost tender... but something about it felt strangely familiar, as if someone long ago had once rolled the very same die."
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.2" }]
  }
]
