[
  {
	"branch": "B_success",
	"event": [
	  { "action": "spawn_character", "target": "Monster1", "pos": [-450, 0] },
	  { "action": "spawn_character", "target": "Alicia", "pos": [450, 0] },
	  { "action": "set_background", "target": "forest_path" },
	  { "action": "show_talk_ui" }
	],
	"text": "The ground suddenly trembles as a beast covered in rocky armor bursts from the earth. Its eyes glow green, and its low roar sends birds scattering through the forest."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "I instinctively grab my pack and raise it in front of me. In the same instant, the creature’s claw slams down. The force makes my footing slip, driving me back two full steps."
  },
  {
	"event": [
	  { "action": "hp_gain", "amount": 10 },
	  { "action": "shake", "target": "Player" }
	],
	"text": "But that split-second block slows it—just enough."
  },
  {
	"text": "Alicia surges forward immediately, her blade flashing like lightning. The strike lands square in the beast’s chest. With a guttural snarl, it staggers, its stone shell cracking apart before dissolving into ash."
  },
  {
	"event": [
	  { "action": "remove_character", "target": "Monster1" }
	],
	"text": "I stare at the deep claw marks torn into my pack, stunned for several seconds. Alicia sheaths her sword and turns to me, her gaze lingering briefly before she smiles—a small smile, but enough to ease the tension."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Quick reflexes.” Her tone is lighter now. “I didn’t expect you to actually hold it off.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Just lucky,” I reply with a wry grin, lifting the damaged pack. “Seems it’s sturdier than I am.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Luck counts as strength too.” She pats my shoulder gently. “Still, don’t try to block like that next time. They’re stronger than they look.”"
  },
  {
	"text": "She kneels to examine the scorched earth, her brows knitting slightly. “These creatures aren’t born naturally. They’re ‘Lingering Dreams’—traces left behind by the dead.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Lingering Dreams?” I repeat, still catching my breath."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Yes. In places where wars were fought and lives were lost, their final emotions sink into the soil. Over time, they become things like this.”"
  },
  {
	"text": "She rises, her expression softening, her voice gentler."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“But don’t worry. As long as I’m here, I won’t let them get close.”"
  },
  {
	"text": "She extends her hand. After a brief hesitation, I take it. With a light pull and a smile, she helps me to my feet. “Come on—the market’s just ahead.”"
  },
  {
	"text": "A breeze drifts through the trees, sunlight catching in her silver hair, bright enough to make it hard to look away."
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.5" }]
  }
]
