[
  {
	"event": [
	  { "action": "hide_talk_ui" },
	  { "action": "unlock", "target": "1_2" }
	]
  },
  {
	"text": "The noon sunlight filters through gaps in the clouds, spilling onto the inn’s signboard as dust drifts slowly in the golden beams."
  },
  {
	"text": "Outside, a layer of snow has melted away, leaving the stone-paved street damp. The air carries the scent of fresh bread and simmering stew."
  },
  {
	"text": "I toss the broken wood from this morning’s chaos into the fire pit in the backyard. The flames crackle as heat rises in waves."
  },
  {
	"text": "The rare calm of the day almost makes one forget last night’s storm and noise."
  },
  { "text": "But I didn’t expect her to return." },
  { "text": "The doorbell rings softly." },
  {
	"text": "Alicia steps inside, frost still clinging to her armor. Behind her follows a young girl, chestnut hair tied in short braids, lively eyes shining. She carries a basket filled with bottles of different colors, like droplets of dew sealed by light.",
	"event": [
	  { "action": "spawn_character", "target": "Alicia", "pos": [-450, 0] },
	  { "action": "spawn_character", "target": "Lucia", "pos": [450, 0] },
	  { "action": "show_talk_ui" }
	]
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Innkeeper, I brought you a few small things today. Healing potions and antidotes. I heard you often get drunkards injuring themselves here.”"
  },
  {
	"text": "I blink in surprise. Before I can respond, the girl has already run to the counter, curiously looking around the room."
  },
  {
	"event": [{ "action": "show_name", "target": "Lucia" }],
	"text": "“Master, this place is so quiet—and really warm.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Lucia" }],
	"text": "“It doesn’t feel like an inn. It feels like home.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Lucia, don’t say such things.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“It’s fine. She’s not wrong. This place has been a little too quiet lately.”"
  },
  {
	"text": "I set down the rag in my hand and glance out at the street through the window."
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“There used to be merchant caravans passing by every day. Now you can wait all day without seeing a single one.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“They say monsters have reappeared in the northern forest.” I pause. “Several patrols have gone missing. Even the Church won’t go near it.”"
  },
  {
	"event": [
	  { "action": "show_name", "target": "Lucia" },
	  { "action": "shake", "target": "Lucia" }
	],
	"text": "“Are there really monsters? I thought it was just a rumor.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Rumors usually have some truth at their root. When we passed nearby, I felt something was wrong with the forest air… it smelled like rust.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“You noticed it too?”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Yes. The wind carried the scent of rust. Like blood.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Lucia" }],
	"text": "“I actually thought it smelled kind of nice.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“That just means you’re still a child.”"
  },
  {
	"text": "Watching their natural interaction, a strange sense of reassurance wells up inside me—perhaps in this chaotic world, laughter like this is the rarest treasure of all."
  },
  {
	"event": [{ "action": "show_name", "target": "Lucia" }],
	"text": "“I made this one myself! You won’t get drunk or have a headache, but it tastes really good! Want to try it, big brother?”"
  },
  {
	"text": "As she speaks, Lucia pulls out a small bottle from her basket. The cork nearly pops off, and a sweet fragrance immediately fills the air."
  },
  {
	"event": [{ "action": "show_name", "target": "Lucia" }],
	"text": "“Smell it—it’s mixed with honey and strawberries.” She excitedly holds the bottle up to me."
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "Caught off guard by the scent, I chuckle. “It actually smells pretty good.”"
  },
  {
	"event": [{ "action": "add_item", "target": "Herbs", "amount": 1 }]
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“If you don’t want to end up sleeping under the counter for three days, don’t drink it.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Lucia" }],
	"text": "“That won’t happen!” She puffs her cheeks, looking serious."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“The last time she tested her potion, she slept for three days.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Lucia" }],
	"text": "“That was an experimental accident!”"
  },
  {
	"text": "Their banter feels like a fresh breeze, sweeping away the gloom that lingered from the morning."
  },
  {
	"text": "I suddenly realize that ever since she stepped into the inn, the air itself has felt different—like sunlight melting a river long frozen."
  },
  {
	"event": [
	  {
		"action": "show_option_ui",
		"options": [
		  { "text": "Option A: Proactively ask Alicia if she’d like to book a room for Lucia", "dc": 0, "check": "charisma" },
		  { "text": "Option B: Tease, “So, are you two going to share one room?”", "dc": 5, "check": "charisma" }
		]
	  },
	  { "action": "hide_talk_ui" }
	]
  }
]
