[
  {
	"event": [
	  { "action": "set_background", "target": "underground_entrance" },
	  { "action": "spawn_character", "target": "Lucia", "pos": [-450, 0] },
	  { "action": "spawn_character", "target": "EnemyLeader", "pos": [450, 0] },
	  { "action": "show_talk_ui" }
	],
	"text": "The air suddenly freezes. The chanting stops abruptly, and several gazes gather from the shadows—cold and eerie. The blue glow of the ritual circle flickers across the ground like an awakening eye."
  },
  {
	"event": [
	  { "action": "remove_character", "target": "Lucia" },
	  { "action": "spawn_character", "target": "Enemy1", "pos": [-450, 0] },
	  { "action": "show_talk_ui" }
	],
	"text": "I don’t hesitate. I kick off the ground hard, snow and dust flying together, my short blade carving a streak of silver light in the air."
  },
  {
	"text": "The robed figures clearly didn’t expect me to charge straight in. Two casters hurriedly raise their hands, blue light gathering in their palms."
  },
  {
	"event": { "action": "shake", "target": "Enemy1" },
	"text": "I duck low and slide past the spell-light, sparks bursting above my head. In the next instant, my blade is already buried in one of their chests."
  },
  {
	"event": { "action": "show_name", "target": "Enemy1" },
	"text": "“Urgh—!”"
  },
  {
	"event": [
	  { "action": "remove_character", "target": "Enemy1" },
	  { "action": "spawn_character", "target": "Lucia", "pos": [-450, 0] }
	],
	"text": "Blood splashes across the ritual lines, and the blue glow falters. The chanting breaks off, and the energy in the air fractures like shattered glass."
  },
  {
	"event": { "action": "show_name", "target": "Lucia" },
	"text": "“Nice one!”"
  },
  {
	"text": "Lucia shouts, lifting her staff as a beam of light cleaves toward the other caster. The blue shield shatters on impact."
  },
  {
	"event": { "action": "show_name", "target": "EnemyLeader" },
	"text": "“Stop them—the ritual must not cease!”"
  },
  {
	"text": "The leader roars and forms a seal. The ritual circle beneath his feet flares again. Seizing the moment, I rush forward—my blade collides with the sigil in his hand."
  },
  {
	"event": { "action": "shake", "target": "Player" },
	"text": "The clash of steel and arcane light rings in my ears. The sigil in his hand shatters, backlash energy surging as blue light recoils violently."
  },
  {
	"text": "I stagger back half a step, blood surging in my veins—but I see that the chains at the ritual’s core have loosened."
  },
  {
	"event": { "action": "show_name", "target": "Lucia" },
	"text": "“Now!”"
  },
  {
	"text": "Lucia chants the final incantation. Light spreads along her staff. The chains snap, sparks scattering. Alicia’s body falls from the pillar and is caught by Lucia."
  },
  {
	"event": { "action": "show_name", "target": "EnemyLeader" },
	"text": "“No—!”"
  },
  {
	"text": "The leader tries to form another seal, but I’m already in front of him. I kick him square in the chest. Blue runes explode as he’s hurled into the stone wall."
  },
  {
	"text": "The ritual light flickers out of control. Sigils along the walls crumble layer by layer. The low hum turns into a roaring collapse."
  },
  {
	"event": [
	  { "action": "remove_character", "target": "EnemyLeader" }
	],
	"text": "After a violent surge of energy, the black-robed leader is swallowed by the collapsing light—completely gone."
  },
  {
	"text": "The rumbling gradually fades. Dust and scorched air fill the underground chamber, broken stones still smoking."
  },
  {
	"text": "Gasping for breath, I push myself upright. Blood still drips from the edge of my blade. I lift Alicia into my arms, my face smeared with ash."
  },
  {
	"event": [
	  { "action": "show_name", "target": "Lucia" },
	  { "action": "spawn_character", "target": "Alicia", "pos": [450, 0] }
	],
	"text": "“She’s alive—her heartbeat is weak, but it’s there!”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“We have to get out—this place is collapsing!”"
  },
  {
	"text": "I move ahead, clearing debris from our path."
  },
  {
	"event": [
	  { "action": "set_background", "target": "Street" }
	],
	"text": "The night wind rushes against us. Snow hits my skin like needles. Streetlamps flicker faintly in the distance."
  },
  {
	"event": { "action": "show_name", "target": "Lucia" },
	"text": "“That strike just now… it was perfect.”"
  },
  {
	"text": "There’s shock—and a hint of admiration—in her eyes."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“She taught me.”"
  },
  {
	"text": "I look down at Alicia in my arms, a bitter smile forming. “Looks like I finally got to repay a life.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“…Thank you…”"
  },
  {
	"text": "Her voice is barely a whisper, like wind slipping past her lips. Her lashes tremble before she sinks back into unconsciousness."
  },
  {
	"event": { "action": "show_name", "target": "Lucia" },
	"text": "“What did she say?”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“She’s alive. That’s enough.”"
  },
  {
	"text": "I lift my gaze toward the northern night sky. The wind scatters the remaining snow, and the town bell rings in the distance."
  },
  {
	"text": "In that moment, I suddenly understand: the real battle is far from over. My palm burns faintly—the place that touched the ritual still flickers with blue light."
  },
  {
	"event": [
	  { "action": "change_scene", "target": "scene1.7" }
	]
  }
]
