[
  {
	"event": [
	  { "action": "set_background", "target": "tavern_out" },
	  { "action": "unlock","target": "1_7" },
	  { "action": "show_talk_ui" }
	],
	"text": "The sunlight is just right. The town market is livelier than usual—children selling flowers, vendors’ calls drifting softly with the wind."
  },
  {
	"text": "I sit on the wooden steps outside the tavern, watching the fountain at the center of the square. The droplets sparkle in the sun as if nothing had ever happened."
  },
  {
	"event": [
	  { "action": "show_name", "target": "Alicia" },
	  { "action": "spawn_character", "target": "Lucia", "pos": [-450, 0] }
	],
	"text": "Alicia has changed into a light-colored dress, her silver hair simply tied behind her. No armor, no sword. She looks slightly weaker than before, as if she still hasn’t fully recovered from last night."
  },
  {
	"text": "“A rare morning,” she says with a smile. “I want to try living a normal person’s day for once.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Heroes get days off too?” I laugh."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Sometimes they must.” She sits beside me, looking toward the children in the square. “Otherwise, you forget who you are.”"
  },
  {
	"event": [
	  { "action": "set_background", "target": "Square" }
	],
	"text": "We head to the bakery near the town entrance. The old shopkeeper freezes for a moment when he sees her, then smiles and presses two sweet rolls into her hands. “Last time you saved my grandson, I never got to thank you.”"
  },
  {
	"text": "“Then I’ll accept it today.” She smiles, then turns and hands one of them to me."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“I didn’t save anyone.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“But you’re sharing breakfast with me.”"
  },
  {
	"text": "The bread is almost too sweet, yet it carries a long-lost sense of peace. Sunlight glints off her eyelashes. In that moment, she looks less like a warrior and more like a traveler."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“If there were no monsters,” I suddenly ask, “would you want to stay?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She pauses, fingers brushing the edge of the paper bag. “I’ve thought about that. But I don’t belong here.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“By ‘here,’ do you mean the town—or the world?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She falls silent for a moment, then smiles faintly. “Maybe… time itself.”"
  },
  {
	"text": "We step out of the bakery. Wind chimes ring softly as children chase pigeons across the street. She pauses at a flower stall, her gaze resting on a bundle of white hyacinths, before shaking her head."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“I used to like flowers,” she says suddenly. “But later, every time I saw them bloom, I thought… they all live longer than I do.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Don’t say that.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“It’s just the truth.” She smiles gently. “But today, I want to pretend—I’m still alive.”"
  },
  {
	"text": "Her voice is so soft, as if afraid to disturb the tenderness of the moment. I don’t reply. I simply walk beside her."
  },
  {
	"text": "The bell in the square rings. She looks up at the sky and adjusts her cloak."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“I need to check the barrier at the north gate.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Now?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Just to confirm something.” Her expression turns serious. “Listen—no matter what happens tonight, don’t leave the house.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Why?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She doesn’t answer. Instead, she gently taps the air in front of my chest. A nearly invisible streak of light flickers like dust in the sun."
  },
  {
	"event": [
	  { "action": "add_item", "target": "Talisman", "amount": 1 }
	],
	"text": "“This is my protective charm,” she says with a smile. “It will keep you dreamless for one night.”"
  },
  {
	"event": [
	  { "action": "remove_character", "target": "Alicia" }
	],
	"text": "She lifts her basket and walks into the crowd. Her silver hair glimmers in the sunlight, gradually disappearing at the far end of the bustling market."
  },
  {
	"text": "Wind blows from the north, carrying an uneasy chill. The fountain suddenly splashes higher than usual."
  },
  {
	"text": "I look up. The sky is clear, yet a faint shadow slips between the clouds."
  },
  {
	"text": "A cold feeling settles in my chest. But in the next moment, children’s laughter and vendors’ calls drown everything out. The sunlight remains gentle."
  },
  {
	"text": "I let out a long breath, yet I can’t shake the feeling that something is quietly drawing near."
  },
  {
	"event": [
	  { "action": "change_scene", "target": "scene1.8" }
	]
  }
]
