[
  {
	"branch": "C_success",
	"event": [
	  { "action": "spawn_character", "target": "Monster1", "pos": [-450, 0] },
	  { "action": "spawn_character", "target": "Alicia", "pos": [450, 0] },
	  { "action": "set_background", "target": "forest_path" },
	  { "action": "show_talk_ui" }
	],
	"text": "The monster let out a deep growl, the rocky plates on its limbs glinting coldly. Its breath was hot and heavy, as if it could crush the whole forest beneath it."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "I forced myself to stay calm, eyes fixed on its movements. It was fast and heavy, but each time it landed, its right foreleg hesitated slightly."
  },
  {
	"text": "In that moment, I understood—that was its weak point."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Alicia! Its right leg—there’s a crack there!” I shouted."
  },
  {
	"event": { "action": "shake", "target": "Monster1" },
	"text": "She reacted instantly, twisting her stance as her body flashed like silver light. Her blade struck cleanly at the crack. With a muffled impact, the creature froze mid-motion before collapsing, dissolving into a cloud of gray smoke."
  },
  {
	"event": [{ "action": "remove_character", "target": "Monster1" }],
	"text": "I exhaled heavily, my legs still trembling. Alicia sheathed her sword, scanning the ground to ensure the creature was truly gone before turning back to me."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“That shout just saved my life,” she said with a faint smile. “Sharp eyes you’ve got there.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“I… just got lucky.” I scratched my head awkwardly."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Luck doesn’t tell you where a crack is.” She chuckled softly. “Next time you notice something like that, tell me sooner.”"
  },
  {
	"text": "The wind swept through the forest, carrying away the lingering smoke. Alicia’s gaze fell on the scorched earth, her expression turning solemn."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“These creatures aren’t natural,” she said quietly. “They’re ‘Residual Dreams’—the traces left behind by the dead.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Residual Dreams?” I frowned."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Yes. In places where wars were fought and lives were lost, the ground absorbs their final emotions. Over time, those emotions take form.”"
  },
  {
	"text": "Her gaze softened as she looked at me. “You did well back there. Thank you.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "I smiled sheepishly. “That’s because you’re a good teacher.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She laughed lightly. “I didn’t teach you that.”"
  },
  {
	"text": "She extended her hand, and I instinctively took it—the warmth of her palm still carried the heat of battle."
  },
  {
	"text": "“You sure get comfortable fast. Come on, the market’s just ahead.”"
  },
  {
	"text": "Alicia smiled again, a soft, fleeting smile like sunlight filtering through the trees—warm and hard to look away from."
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.5" }]
  }
]
