[
  {
	"event": [
	  { "action": "spawn_character", "target": "Junker", "pos": [450, 0] },
	  { "action": "spawn_character", "target": "Alicia", "pos": [-450, 0] }
	]
  },
  {
	"text": "I slowly move my hand toward my short sword, but I don’t expect the scabbard at my waist to lightly clash with a clear ‘clang.’"
  },
  {
	"text": "The drunk whirls around, bloodshot eyes glaring at me."
  },
  {
	"event": [{ "action": "show_name", "target": "Junker" }],
	"text": "“What are you trying to do?!”"
  },
  {
	"text": "His anger ignites at once, his fist slamming heavily onto the table, wine splashing everywhere."
  },
  {
	"event": [{ "action": "show_name", "target": "Junker" }],
	"text": "“You dare draw your sword?!”"
  },
  {
	"text": "I instinctively take a step back. My hand hasn’t fully gripped the hilt yet, but the air is already thick with tension."
  },
  {
	"text": "Just as he takes that step forward, a sharp sound cuts through the air—"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "Alicia is already on her feet, her cloak sweeping past the hearth as a flash of silver light flickers."
  },
  {
	"text": "No one sees what she does. In the next instant, the drunk is pinned to the ground, his face buried in his own spilled wine.",
	"event": { "action": "shake", "target": "Junker" }
  },
  {
	"text": "I stare at her in a daze. At that moment, I finally realize—I never needed to draw my sword at all."
  },
  {
	"event": { "action": "remove_character", "target": "Junker" },
	"text": "She withdraws her blade, the firelight glinting faintly along the fractured patterns etched into the steel."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“You were a step too slow.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“Looks like you didn’t need any help either.”"
  },
  {
	"text": "Alicia lifts her gaze slightly. The firelight flickers in her pupils, as if she’s smiling—or perhaps not."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Perhaps.”"
  },
  {
	"text": "She slowly sheaths her sword, the metal brushing softly against the scabbard."
  },
  {
	"text": "The air begins to move again. The hearth crackles, and a few patrons peek out before retreating back to their seats."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Clean this up. No need to attract the guards and invite trouble.”"
  },
  {
	"text": "Her voice carries no command—only a calm statement."
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“Alright.”"
  },
  {
	"text": "I nod and pick up a cloth to wipe the spilled wine from the table. She stands quietly nearby, as if waiting for me—or perhaps lost in thought."
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.1" }]
  }
]
