[
  {
	"event": [
	  { "action": "hide_talk_ui" },
	  { "action": "set_background", "target": "tavern_night" }
	]
  },
  {
	"event": { "action": "show_talk_ui" },
	"text": "Night had fallen. Outside, the sound of snow was as fine as sand. The fireplace burned bright, the logs crackling now and then."
  },
  {
	"text": "I leaned against the counter. The dim yellow light illuminated half the tavern. Lucia had long gone to bed; the whole place was so quiet I could hear the wind breathing through the door cracks."
  },
  {
	"text": "The firelight flickered, and the shadow on the wall swayed twice. I thought it was the wind—then came a soft creak from the stairs—"
  },
  {
	"event": [{ "action": "spawn_character", "target": "Alicia", "pos": [450, 0] }],
	"text": "Alicia came down in a silver cloak, her hair catching a faint gold under the firelight. She approached the counter and pointed at the wine shelf. “Still awake? Good—pour me one.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Can’t sleep?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Mm.” she said softly. “Nights in this town are too quiet. Quiet enough to remind me of... somewhere else.”"
  },
  {
	"text": "I poured her a glass. She sat at the counter, her movements so light they barely made a sound. The amber liquid shimmered gently in the firelight."
  },
  { "text": "She didn’t drink right away, just stared at the surface of the wine." },
  {
	"text": "“Your wine here is strange.” She smiled. “Not like the warm kind we have in the south.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“People here fear the cold too much. Stronger wine keeps them warm longer.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“True.” She took a sip. “Winter in the North... can freeze even a dream solid.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Doesn’t sound like something a traveler would say.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Maybe I’m not. I came here to investigate something.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Something serious?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Maybe fate itself.” She lifted her gaze to me. The firelight caught her eyes—gray-blue, deep as a lake beneath snow."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Or rather, destiny.” she added. The air stilled."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Do you believe in destiny?”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Destiny? I think it’s just something people use to make excuses for themselves.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She chuckled softly. “That sounds exactly like something a man who sees through everything would say.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Not really. I just think destiny—it's too easy to use as an escape.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Maybe.” she murmured. “But some people never had a choice to begin with.”"
  },
  {
	"text": "I didn’t understand, but her tone felt heavy."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“And you? Are you one of those who ‘never had a choice’?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "Her hand paused at the rim of the glass. She looked like she wanted to answer—but stopped herself."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“I don’t remember.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“You don’t remember?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“No.” She smiled faintly. “I just feel like I’ve lived through this night many times—fire, wine, snow... and many friendly or unfriendly faces.”"
  },
  {
	"text": "My heart skipped. “What do you mean?”"
  },
  { "text": "She blinked. “Nothing. Just a thought from someone who’s seen too much.”" },
  {
	"text": "The fire crackled, and her shadow stretched across the wall. There weren’t one but two of them—one seated before me, and another faint, blurred one."
  },
  {
	"text": "I blinked again, and they had merged into one."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Do you know a soul leaves traces?”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“What do you mean?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She looked into the fire. “Some say that three days after death, a person’s shadow follows the trace back to three days before.”"
  },
  {
	"text": "“It’s an ancient magic—Soul Mechanics. It lets the dead return three days into the past to rewrite their fate.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Sounds like a story.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“It is. But sometimes, stories are safer than the truth.”"
  },
  {
	"text": "Her cup was empty, yet she still held it by the rim, unmoving."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“If you had the chance to relive three days,” she asked suddenly, “what would you do?”"
  },
  {
	"event": [
	  {
		"action": "show_option_ui",
		"options": [
		  {
			"text": "Option A: Say seriously, “I’d try to change fate.” [Intelligence Check DC 7]",
			"dc": 7,
			"check": "intelligence"
		  },
		  {
			"text": "Option B: Say casually, “I’d keep running the inn as usual.” [Wisdom Check DC 5]",
			"dc": 5,
			"check": "wisdom"
		  },
		  {
			"text": "Option C: Ask her back, “And you? What would you want to change?” [Charisma Check DC 6]",
			"dc": 6,
			"check": "charisma"
		  }
		]
	  },
	  { "action": "hide_talk_ui" }
	]
  }
]
