[
  {
	"branch": "B_success",
	"event": [
	  { "action": "spawn_character", "target": "Monster1", "pos": [-450, 0] },
	  { "action": "spawn_character", "target": "Alicia", "pos": [450, 0] },
	  { "action": "set_background", "target": "forest_path" },
	  { "action": "show_talk_ui" }
	],
	"text": "The ground suddenly shook as a rock-armored beast burst from the soil, its glowing green eyes scattering the forest birds with a thunderous growl."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "Instinctively, I grabbed my backpack and raised it to block. In that same instant, the creature’s claws came crashing down. The impact was so strong it forced me back two steps."
  },
  {
	"event": [
	  { "action": "hp_gain", "amount": 10 },
	  { "action": "shake", "target": "Player" }
	],
	"text": "But that block slowed its attack just enough."
  },
  {
	"text": "Alicia dashed forward, her sword flashing like lightning. The blade struck the beast square in the chest. With a guttural roar, it staggered and collapsed—its rocky shell crumbling into ash."
  },
  {
	"event": [{ "action": "remove_character", "target": "Monster1" }],
	"text": "I stared at the claw marks on my torn backpack, frozen for a few seconds. Alicia sheathed her sword and turned toward me, her eyes lingering for a moment before she smiled—a small smile, but enough to make me breathe easier."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Quick reflexes,” she said lightly. “Didn’t think you’d actually block that.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Just lucky,” I replied with a wry grin, holding up the ruined pack. “Looks like it’s tougher than me.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Luck counts as skill too.” She gave my shoulder a gentle pat. “But next time, don’t take the hit head-on. Those things are stronger than you think.”"
  },
  {
	"text": "She crouched down, examining the scorched patch of earth. Her brows knit slightly. “These monsters aren’t natural. They’re ‘Residual Dreams’—echoes left behind by the dead.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Residual Dreams?” I repeated, still catching my breath."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Yes. In places where wars were fought and lives were lost, the ground absorbs their final emotions. Over time, those emotions take form.”"
  },
  {
	"text": "She stood up, her gaze softening, her voice gentler than before."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“But don’t worry. As long as I’m here, they won’t get close.”"
  },
  {
	"text": "She extended her hand toward me. I hesitated for a moment, then took it. Smiling, she pulled me to my feet. “Come on, the market’s just ahead.”"
  },
  {
	"text": "A breeze swept through the trees. Sunlight glinted off her silver hair, so bright I couldn’t look away."
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.5" }]
  }
]
