[
  {
	"event": [
	  { "action": "hide_talk_ui" }
	]
  },
  {
	"text": "Noon sunlight streamed through the cracks in the clouds, falling over the inn’s signboard. Dust drifted lazily in the golden light."
  },
  {
	"text": "The snow outside had melted in patches, leaving the cobblestones damp. The air was filled with the scent of bread and stew."
  },
  {
	"text": "I was tossing the broken wood left from the morning’s chaos into the fire pit behind the inn. The flames crackled, heat rising into the cold air."
  },
  {
	"text": "The rare calm of the day almost made me forget last night’s wind and noise."
  },
  { "text": "But I didn’t expect her to return." },
  { "text": "The doorbell chimed softly." },
  {
	"text": "Alicia stepped inside, the frost on her armor still unthawed. Behind her was a young girl with chestnut hair tied in a short braid. Her bright eyes were full of curiosity, and in her arms she carried a basket of colorful bottles — like tiny drops of light trapped in glass.",
	"event": [
	  { "action": "spawn_character", "target": "Alicia", "pos": [-450, 0] },
	  { "action": "spawn_character", "target": "Lucia", "pos": [450, 0] },
	  { "action": "show_talk_ui" }
	]
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Shopkeeper, we brought you a few things. Healing potions and antidotes. I heard you often get drunkards hurting themselves around here.”"
  },
  {
	"text": "I blinked, still processing her words, while the young girl had already wandered to the counter, wide-eyed, taking everything in."
  },
  {
	"event": [{ "action": "show_name", "target": "Lucia" }],
	"text": "“Master, this place is so quiet! And so warm!”"
  },
  {
	"event": [{ "action": "show_name", "target": "Lucia" }],
	"text": "“It doesn’t feel like an inn. It feels like a home.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Lucia, mind your tongue.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“It’s fine. She’s right, though. This place is a bit too quiet.”"
  },
  {
	"text": "I put down the cloth in my hand and glanced toward the street outside the window."
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“You used to hear the bells of caravans passing every day. Now you can go an entire day without seeing a soul.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“They say beasts have appeared again in the northern forest.” I paused. “Several patrols vanished. Even the church won’t go near it.”"
  },
  {
	"event": [
	  { "action": "show_name", "target": "Lucia" },
	  { "action": "shake", "target": "Lucia" }
	],
	"text": "“Real monsters? I thought that was just a rumor!”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Rumors often have roots. When we passed near there, I could feel the air wasn’t right… there was a smell—like rust.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“You noticed that too?”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Yes. The wind carried a scent of rust… or perhaps blood.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Lucia" }],
	"text": "“I thought it smelled kind of nice.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“That only means you’re still a child.”"
  },
  {
	"text": "Watching the two of them, I felt a strange sense of peace—like their laughter was something precious in a world that had forgotten warmth."
  },
  {
	"event": [{ "action": "show_name", "target": "Lucia" }],
	"text": "“I made this one myself! It won’t make you drunk or dizzy—but it tastes really good! Wanna try, big brother?”"
  },
  {
	"text": "Lucia fumbled out a tiny bottle, popping the cork so hard it almost flew off. A sweet aroma filled the air instantly."
  },
  {
	"text": "“Smell it! I mixed it with honey and strawberries!” she said excitedly, holding the bottle up to my face.",
	"event": [{ "action": "show_name", "target": "Lucia" }]
  },
  {
	"text": "The scent hit me, and I coughed lightly before smiling. “Smells pretty good, actually.”",
	"event": [{ "action": "show_name", "target": "Player" }]
  },
  {
	"text": "Alicia sighed softly beside her. “If you don’t want to sleep under your counter for three days, don’t drink it.”",
	"event": [{ "action": "show_name", "target": "Alicia" }]
  },
  {
	"text": "“That was an accident!” Lucia puffed up her cheeks in protest, eyes wide with innocence.",
	"event": [{ "action": "show_name", "target": "Lucia" }]
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Her last experiment put her to sleep for three days straight.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Lucia" }],
	"text": "“It was an experiment error!”"
  },
  {
	"text": "Their banter was like a breeze through the room, sweeping away the gloom I’d carried all morning."
  },
  {
	"text": "I suddenly realized—the air itself felt lighter since she walked in, as if the frozen river of my world had just started to thaw."
  },
  {
	"event": [
	  {
		"action": "show_option_ui",
		"options": [
		  { "text": "Option A: Ask Alicia if she wants to book a room for Lucia", "dc": 0, "check": "charisma" },
		  { "text": "Option B: Joke, 'Are you two sharing a room?'", "dc": 5, "check": "charisma" }
		]
	  },
	  { "action": "hide_talk_ui" }
	]
  }
]
