[
  {
	"event": [
	  { "action": "set_background", "target": "underground_entrance" },
	  { "action": "spawn_character", "target": "Lucia", "pos": [-450, 0] },
	{ "action": "unlock","target": "BadEnding2" },
	  { "action": "spawn_character", "target": "EnemyLeader", "pos": [450, 0] },
	  { "action": "show_talk_ui" }
	],
	"text": "My heart pounded so hard it felt like it might tear through my chest as I stared at the ritual circle."
  },
  {
	"text": "The chanting wrapped around my thoughts like an invisible net, suffocating me under its weight."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Lucia, we… we have to go,” I whispered, my voice trembling, barely sounding like my own."
  },
  {
	"event": { "action": "show_name", "target": "Lucia" },
	"text": "“What?” She turned, eyes wide in disbelief. “What did you just say?”"
  },
  {
	"text": "I didn’t look back. I just ran—toward the exit as fast as I could."
  },
  {
	"text": "🎲 [Will Check: Failed] Your fear overwhelms your reason. All you can hear is your heartbeat."
  },
  {
	"text": "The explosion of the ritual echoed behind me. Blue light devoured the shadows inch by inch, as if countless unseen eyes were watching."
  },
  {
	"event": { "action": "show_name", "target": "Lucia" },
	"text": "Lucia shouted, “The mentor’s still inside! What are you doing, you coward?!”"
  },
  {
	"event": { "action": "shake", "target": "Lucia" },
	"text": "A violent shockwave cut her words short. The walls cracked, iron shards scattering through the air."
  },
  {
	"event": [
	  { "action": "remove_character", "target": "EnemyLeader" },
	  { "action": "remove_character", "target": "Lucia" }
	],
	"text": "I was thrown down the stairs, my head slamming into the floor. Everything went dark."
  },
  {
	"text": "When I opened my eyes again, the world was no longer the same."
  },
  {
	"event": [
	  { "action": "set_background", "target": "Street" }
	],
	"text": "Half of the underground chamber had collapsed. The air reeked of ash and burnt stone. Lucia and Alicia were nowhere to be seen."
  },
  {
	"event": { "action": "hp_lost", "amount": 70 },
	"text": "Pain tore through my chest—each breath felt like swallowing knives."
  },
  {
	"text": "I staggered to my feet. Beneath me lay a broken stone pillar, faint runes still glowing across its surface."
  },
  {
	"text": "The altar at the center was empty now. Only a wisp of blue mist hovered in the air—Alicia’s shattered amulet."
  },
  {
	"text": "I stumbled closer and reached out my hand."
  },
  {
	"event": { "action": "shake", "target": "Player" },
	"text": "The moment my fingers brushed it, a low murmur echoed in my ears:"
  },
  {
	"text": "“...The Cycle is not over... the memory shall be reforged...”"
  },
  {
	"text": "The voice came from within me. I staggered back as the blue light flared, the fragments scattering into the air like dust."
  },
  {
	"text": "Then—silence."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "I stood there in a daze. Only ashes and cold wind surrounded me."
  },
  {
	"text": "The sound of collapsing stone faded away, like the last notes of a funeral song."
  },
  {
	"text": "I reached the exit. As I pushed the door open, snow was falling outside."
  },
  {
	"text": "A gust of wind slipped through the cracks, snuffing out the last of the fire behind me."
  },
  {
	"text": "I looked down—and saw the brass die lying quietly on the ground, face-down."
  },
  {
	"text": "I picked it up. It rolled once in my palm and stopped—showing a zero."
  },
  {
	"text": "I froze. That die was never supposed to have a zero."
  },
  {
	"event": [
	  { "action": "set_flag", "flag": "BadEnd_RunnerFail", "value": true },
	  { "action": "change_scene", "target": "scene_bad_end_runner_fail" }
	],
	"text": "【Bad Ending: The Collapsing Cycle】"
  },
  {
	"text": "The snow kept falling. No one answered."
  }
]
