[
  {
	"event": [
	  { "action": "spawn_character", "target": "Junker", "pos": [450, 0] },
	  { "action": "spawn_character", "target": "Alicia", "pos": [-450, 0] }
	]
  },
  { "text": "The drunk’s footsteps draw closer and closer, the cups on the table trembling lightly as the smell of alcohol thickens in the air." },
  { "text": "I do not step back. Instead, I slowly rest my hand on the hilt of my short sword, my fingertips pressing down slightly." },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“You’d better stop.”"
  },
  { "text": "The drunk pauses for a moment, the corner of his mouth twitching. He doesn’t seem to take me seriously and steps forward again." },
  { "text": "A flash of steel—my blade is already drawn. The chill edge brushes across his throat, leaving a thin pale line where the skin meets the sword." },
  { "text": "His breath catches. He freezes completely, not even daring to move his eyes." },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“Move again, and I’ll call the town guard.”"
  },
  {
	"event": [{ "action": "shake", "target": "Junker" }],
	"text": "The drunk swallows with difficulty, his neck trembling slightly beneath the blade."
  },
  {
	"event": [{ "action": "show_name", "target": "Junker" }],
	"text": "“You… you’re joking, right?”"
  },
  { "text": "I do not answer. I simply press the blade an inch closer, the cold gleam reflecting on his face as if even his sweat has frozen." },
  { "text": "The only sounds in the air are the crackle of the fire and his ragged breathing." },
  { "text": "Alicia stands to the side, watching me calmly. A trace of approval flickers in her eyes." },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Stand down.”"
  },
  {
	"text": "The drunk stumbles backward, nearly crawling as he rushes out the door, crashing into the wind and snow."
  },
  {
	"event": [{ "action": "remove_character", "target": "Junker" }],
	"text": "With a loud bang, the door is slammed shut by the wind, and the hearth flame wavers slightly."
  },
  {
	"text": "I withdraw my short sword. The blade glints faintly in the firelight, like a bolt of lightning frozen in place."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Well done.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“I just reacted quickly by chance.”"
  },
  {
	"text": "She looks at me as if she wants to say something, but only offers a faint smile."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Don’t get used to relying on luck.”"
  },
  {
	"text": "She turns and glances over the overturned tables and spilled wine."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Clean this up. I’ll help you.”"
  },
  {
	"text": "Her tone remains calm, though softer than before."
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“Alright.”"
  },
  {
	"event": [{ "action": "add_item", "target": "tactical_ring" }],
	"text": "She removes the silver ring from her finger and lightly tosses it to me."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“You reacted well. Take this—perhaps it’ll help you if something like this happens again.”"
  },
  {
	"text": "Intricate circuits are engraved along the inner side of the ring, faintly glowing blue."
  },
  {
	"text": "I lower my sword and pick up the ring, walking toward the counter. The hearth begins to dance again, and the chill in the air gradually fades."
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.1" }]
  }
]
