[
  {
	"event": [
	  { "action": "spawn_character", "target": "Junker", "pos": [450, 0] },
	  { "action": "spawn_character", "target": "Alicia", "pos": [-450, 0] }
	]
  },
  {
	"text": "I step forward, keeping my voice as gentle as possible.",
	"event": [{ "action": "show_name", "target": "Player" }]
  },
  { "text": "“Friends, the drinks are on me. No need to get angry.”" },
  {
	"text": "The drunk glares furiously and shoves me aside. Wine spills across the floor as his fist slams onto the counter, the wood letting out a dull crack.",
	"event": [{ "action": "show_name", "target": "Junker" }]
  },
  { "text": "“Stop pretending to be a good person!”" },
  { "text": "“Everyone in this town looks down on me, don’t they?!”" },
  {
	"text": "I’m forced back step by step, several cups falling from the shelves and shattering, the sound piercingly loud in the silent tavern."
  },
  {
	"text": "His eyes are muddled and wild, fury burning in them like a trapped beast as he advances."
  },
  {
	"text": "I raise my hands, about to speak again, when the wind outside suddenly intensifies and the door slams with a loud bang."
  },
  {
	"text": "The hearth fire is pressed low by the wind, flames flickering violently in the air. Everyone holds their breath."
  },
  {
	"text": "Cold air from the doorway surges in with the light, carrying the chill of snow and the scent of metal."
  },
  {
	"text": "The cloaked woman’s gaze falls upon the drunk—calm, yet sharper than the winter wind."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Looks like I arrived just in time. Are mornings here always this noisy?”"
  },
  {
	"text": "Her voice is clear, without menace, yet it naturally brings silence to the room."
  },
  {
	"text": "The drunk opens his mouth to curse, but it is as if some invisible force grips his throat. The air grows still."
  },
  {
	"text": "My heart tightens. The fire flares back to life, light and shadow dancing as her silver hair gleams in the glow like the reflection of a blade.",
	"event": [{ "action": "show_name", "target": "Player" }]
  },
  {
	"text": "She lifts a finger and flicks it lightly. The bottle spins gently in her palm, the spilled wine turning into a fine mist that sparkles in the firelight.",
	"event": [{ "action": "shake", "target": "Junker" }]
  },
  {
	"text": "Everything falls silent. Even the drunk himself freezes, as if his anger has been suddenly drawn away."
  },
  {
	"text": "Only then do I realize the entire tavern’s air has come to a standstill—even the flames no longer waver."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“That’s enough.”"
  },
  {
	"text": "The drunk’s throat bobs, his lips trembling a few times, yet no words come out. He steps back, nearly slipping.",
	"event": [{ "action": "shake", "target": "Junker" }]
  },
  { "text": "“Damn it… crazy woman…”" },
  {
	"text": "Panting, he mutters curses under his breath, then shoves the door open and staggers into the snowstorm.",
	"event": [{ "action": "remove_character", "target": "Junker" }]
  },
  {
	"text": "The door slams shut behind him, snow swirling in the wind. The tavern returns to silence."
  },
  {
	"text": "I take a deep breath, my chest still burning. Her gaze brushes over me lightly; there is no reproach in her eyes, only a faint trace of tenderness."
  },
  {
	"text": "I open my mouth, but no words come. The fire resumes its dance, its light reflecting in her eyes like a bottomless lake of snow."
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.1" }]
  }
]
