[
  {
	"branch": "A_success",
	"event": [
	  { "action": "spawn_character", "target": "Monster1", "pos": [-450, 0] },
	  { "action": "spawn_character", "target": "Alicia", "pos": [450, 0] },
	  { "action": "show_talk_ui" }
	],
	"text": "The ground suddenly trembles as a beast covered in rocky armor bursts from the earth. Its eyes glow green, and its roar sends birds scattering through the forest."
  },
  {
	"text": "I roll sharply to the side, gravel crunching beneath my boots. The beast’s claws sweep past where I stood, striking sparks as they graze the stones."
  },
  {
	"text": "My breath turns cold in my lungs. The moment I regain my footing, Alicia’s figure flashes forward. Her cloak arcs through the wind, and her blade follows in a streak of light."
  },
  {
	"event": [
	  { "action": "shake", "target": "Monster1" }
	],
	"text": "A flash of silver forces the beast back several steps. A hoarse growl rattles from its throat."
  },
  {
	"text": "Spotting an opening, I shout, “Right side—its shell is cracked!”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“I see it.” Her voice remains steady, her movement precise. The blade arcs smoothly, carving a cold line through the air."
  },
  {
	"event": [
	  { "action": "shake", "target": "Monster1" }
	],
	"text": "The beast falters. The green light in its eyes flickers out. Its body stiffens before crashing to the ground, shattered armor scattering dust."
  },
  {
	"event": [
	  { "action": "remove_character", "target": "Monster1" }
	],
	"text": "The air fills with the smell of scorched earth and smoke. Alicia sheaths her sword and turns toward me."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Good reflexes.” She says calmly, though a faint smile curves her lips. “Next time, don’t stand so close.”"
  },
  {
	"text": "I nod, my palms slick with cold sweat, yet a strange thrill rises in my chest—I survived, and I helped."
  },
  {
	"text": "Blackened marks from the burning creature scar the ground. Sunlight filters through the branches, striking her blade with an icy gleam."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“These creatures aren’t natural,” she says quietly. “They’re ‘Lingering Dreams’—traces left behind by the dead.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Lingering Dreams?” I repeat, my voice still unsteady."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Yes. In places where battles were fought and lives were lost, their final emotions sink into the earth. Over time, they become things like this.”"
  },
  {
	"text": "She settles her sword at her side, her expression returning to calm. The wind sweeps through the trees, carrying away the scent of blood."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Come on. The market’s just ahead.” She smiles lightly. “I’ll be counting on you to carry a few things.”"
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.5" }]
  }
]
