[
  {
	"event": [
	  { "action": "set_background", "target": "town_gate_day" },
	  { "action": "unlock", "target": "1_5" },
	  { "action": "show_talk_ui" }
	],
	"text": "The sun hangs high above, the town gates half open. The wind carries the scent of charcoal and spices."
  },
  {
	"event": [
	  { "action": "spawn_character", "target": "Alicia", "pos": [450, 0] },
	  { "action": "show_name", "target": "Alicia" }
	],
	"text": "“See? I told you the sun would be good today.”"
  },
  {
	"text": "Alicia narrows her eyes slightly, gazing down the street."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Good enough to blind someone.”"
  },
  {
	"text": "I raise a hand to shield my eyes. The stone beneath our feet radiates heat."
  },
  {
	"text": "Vendors at the gate pour fruit into wooden barrels. A gust of wind sends the scent of ripe sweetness and warm air toward us. Children run past chasing paper pinwheels, their laughter bright and clear."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“So this is the town market.”"
  },
  {
	"text": "Her gaze travels along the busy street, curious and assessing. “It’s livelier than I expected.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“You really haven’t been here before?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“No. First time.”"
  },
  {
	"text": "She smiles faintly. “Patrol guards spend more time outside the walls than inside.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Then we’d better make it worth the trip.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“If I hadn’t brought you along, you’d still be out there getting your boots chewed off by a monster.”"
  },
  {
	"text": "She huffs softly—but she’s smiling."
  },
  {
	"text": "We cross the central square. Sunlight glints off the white stone statue, the clocktower’s shadow stretching long. Voices, clattering pots, and hoofbeats blend into a vivid tapestry of life."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“At least we can breathe in town.”"
  },
  {
	"text": "She stretches lightly, her tone relaxed. “But don’t relax too much. If monsters are roaming, we may need to check the western line later.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Can’t we rest first?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“We can.”"
  },
  {
	"text": "She arches a brow. “Though I doubt monsters will politely wait for us to feel ready.”"
  },
  {
	"text": "I open my mouth to argue, but her turning smile cuts me off—shallow, yet genuine."
  },
  {
	"text": "The crowd thins slightly as the afternoon settles. Just then, a vendor’s call rings out ahead."
  },
  {
	"text": "Alicia glances at me, a hint of curiosity in her eyes. “Want to take a look?”"
  },
  {
	"text": "We follow the voice to a stall lined with small wares: leather sheaths, whetstones, simple bracers, and several short wooden practice swords. Most eye-catching is a freshly polished short blade—compact, but bright enough to shimmer."
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“How much for this one?”"
  },
  {
	"text": "The vendor sizes me up and smiles warmly. “Not much. Forged by the town smith. I’ll give you a fair price—good for self-defense.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "Alicia glances at the blade. “Don’t pick something flashy. What matters is how it feels in your hand.”"
  },
  {
	"text": "I wrap my fingers around the hilt. The wood grain and leather binding settle naturally against my palm. The sunlight glints along the edge, and for a moment, even my lingering unease feels steadier."
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“I’ll take it.”"
  },
  {
	"event": [{ "action": "add_item", "target": "Sword", "amount": 1 }],
	"text": "I pay and fasten the small sword and simple sheath at my side. It’s not heavy—but each step feels firmer than before."
  },
  {
	"event": {
	  "action": "if_flag",
	  "flag": "injuredByMonster1",
	  "value": true,
	  "target": "scene1.5.1"
	}
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.5.2" }]
  }
]
