[
  {
	"event": [
	  { "action": "hide_talk_ui" },
	  { "action": "unlock", "target": "1_0" },
	  { "action": "set_background", "target": "tavern" }
	]
  },
  { "event": { "action": "set_flag", "flag": "helped_alicia", "value": true } },
  {
	"event": { "action": "show_talk_ui" },
	"text": "Morning mist slides down from the distant hills, drifting along the stone-paved streets into the center of town. Inside the inn, the air carries a faint scent of wood ash."
  },
  { "text": "I stand behind the counter polishing cups, the street outside blurred by fog, the chandelier swaying gently." },

  { "text": "This is the most ordinary moment of the day—before travelers arrive, when only the echo of cups and my own breathing fill the space." },
  { "text": "Sometimes I even wonder if I exist solely for this moment: that quiet before the world awakens, the kind that makes you believe time might show you mercy for a while." },
  { "text": "But that day was different." },
  {
	"text": "The door is suddenly flung open, a gust of cold air rushing in, carrying the mixed scent of snow and rust. The wooden door slams against the wall with a loud bang, tearing the tavern’s silence apart."
  },
  {
	"text": "“Your wine here is fresh enough, right? Give me a bottle to taste!”",
	"event": [
	  { "action": "spawn_character", "target": "Junker", "pos": [450, 0] },
	  { "action": "show_name", "target": "Junker" }
	]
  },
  {
	"text": "He wears filthy leather armor, a damaged mercenary badge hanging from his neck, looking as though he just crawled out of some ruin."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Drinking this early? Brother, the town guard will be here soon. I remember you’re not supposed to drink while on duty, are you?”"
  },

  {
	"event": [
	  { "action": "show_name", "target": "Junker" },
	  { "action": "shake", "target": "Junker" }
	],
	"text": "“Another drink! Or I’ll burn this lousy little shop down with me!”"
  },
  {
	"event": { "action": "hide_name" },
	"text": "His eyes are murky, like a slick of oil. I can smell the stench of decay and gunpowder clinging to him."
  },
  {
	"text": "Several patrons retreat to the corners in fear. Before I can respond, crisp bootsteps sound from outside."
  },
  {
	"event": [
	  { "action": "show_name", "target": "Alicia" }
	],
	"text": "“I heard someone wants to burn the place down.” A woman’s voice carries in—clear, like snow falling on steel."
  },
  {
	"event": [
	  { "action": "spawn_character", "target": "Alicia", "pos": [-450, 0] }
	],
	"text": "A woman in a silver-white cloak steps inside, sunlight pouring in behind her, casting a faint glow over her armor."
  },
  {
	"text": "She is tall, the scabbard at her waist etched with intricate patterns, a weathered lily emblem pinned at her shoulder."
  },
  {
	"text": "Her gaze is calm, yet no one dares approach carelessly."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Good morning.”"
  },
  {
	"text": "Her voice is clear, without menace, yet it naturally brings silence to the room."
  },
  {
	"text": "She walks step by step toward the drunk. He pauses for a moment, then bursts into curses. “Get lost! Don’t stick your nose into this—”"
  },
  {
	"text": "Before he can finish, she raises her hand and slices her finger lightly through the air. The wind halts. The bottle flies from his grasp and lands steadily in her palm."
  },
  {
	"text": "At that moment, the entire tavern feels frozen. Even the hearth flame flickers."
  },
  {
	"event": [
	  {
		"action": "show_option_ui",
		"options": [
		  { "text": "Option A: Step forward to persuade him 【Charisma Check (DC 4)】", "dc": 4, "check": "charisma" },
		  { "text": "Option B: Stay and observe, waiting for the situation to unfold 【No Check (DC 0)】", "dc": 0, "check": "intelligence" },
		  { "text": "Option C: Quietly prepare your short sword for defense 【Strength Check (DC 6)】", "dc": 6, "check": "strength" }
		]
	  },
	  { "action": "hide_talk_ui" }
	]
  }
]
