[
  {
	"event": [
	  { "action": "hide_talk_ui" },
	  { "action": "unlock", "target": "1_3" },
	  { "action": "set_background", "target": "tavern_night" }
	]
  },
  {
	"event": { "action": "show_talk_ui" },
	"text": "Night settles in. The snow outside whispers like fine sand, and the hearth burns brightly, the wood occasionally cracking with a soft pop."
  },
  {
	"text": "I lean against the counter, the dim yellow light illuminating half the inn. Lucia has long since gone upstairs to sleep. The entire place is so quiet that I can hear the wind breathing through the cracks in the door."
  },
  {
	"text": "The firelight flickers, and the shadow on the wall sways twice. I think it’s the wind—until the stairs creak softly."
  },
  {
	"event": [{ "action": "spawn_character", "target": "Alicia", "pos": [450, 0] }],
	"text": "Alicia descends wrapped in her silver-white cloak, her hair faintly golden in the firelight. She approaches the counter and gestures toward the rack. “Still awake? Good—pour me a drink.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Can’t sleep?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Mm.” She answers softly. “The nights in this town are too quiet. So quiet they remind me of… somewhere else.”"
  },
  {
	"text": "I pour her a drink. She sits at the counter, her movements so light they’re almost soundless. The amber liquid glows softly in the firelight."
  },
  { 
	"text": "She doesn’t drink immediately, only gazes at the surface of the glass in thought."
  },
  {
	"text": "“Your wine is unusual,” she says with a faint smile. “Not like the warmed wine we have in the south.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“People here are afraid of the cold creeping in too fast. Stronger liquor helps keep them warm.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“True.” She takes a sip. “The winters of the North… they can freeze a person’s dreams solid.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“That doesn’t sound like something a traveler would say.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Maybe I’m not.” She looks at me. “I came here to investigate something.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Something serious?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Perhaps it’s life.” She meets my gaze, firelight reflected in her gray-blue eyes, deep as a lake beneath snow."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Or rather—fate.” The air tightens as she adds."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Do you believe in fate?”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Fate? I think it’s just an excuse people make for themselves.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She laughs softly. “That does sound like something someone who’s seen through everything would say.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“I wouldn’t say that. I just think fate is too easily used as a way to avoid responsibility.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Perhaps.” She murmurs. “But some people never had a choice from the day they were born.”"
  },
  {
	"text": "I don’t fully understand, only that her tone grows heavy."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“And you? Are you one of those people who ‘never had a choice’?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "Her hand pauses at the rim of her cup, as if she wants to answer—but stops herself."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“I don’t remember.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“You don’t remember?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“That’s right.” She smiles faintly. “I always feel like I’ve lived through nights like this many times—fire, wine, snow, and… many kind or unkind faces.”"
  },
  {
	"text": "My heart skips. “What do you mean?”"
  },
  {
	"text": "She blinks. “Nothing. When you’ve seen enough, you get sentimental now and then.”"
  },
  {
	"text": "The hearth cracks sharply, and her shadow stretches across the wall. Not one shadow—but two. One sits before me; the other is faint, slightly blurred."
  },
  {
	"text": "I blink, and they merge into one again."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Did you know a soul can leave traces?”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“What do you mean?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She looks into the fire. “Some people, three days after death, have shadows that follow their traces back to three days earlier.”"
  },
  {
	"text": "“It’s an ancient magic—Soul Mechanics. It lets the dead return to the world three days prior, to rewrite fate.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Sounds like a story.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“It is. Sometimes stories are safer than truth.”"
  },
  {
	"text": "Her glass is empty, yet she still grips its rim."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“If you had the chance to relive three days,” she suddenly asks, “what would you do?”"
  },
  {
	"event": [
	  {
		"action": "show_option_ui",
		"options": [
		  {
			"text": "Option A: Say seriously, “I would try to change fate.” 【Intelligence Check (DC 7)】",
			"dc": 7,
			"check": "intelligence"
		  },
		  {
			"text": "Option B: Casually say, “I’d keep running the inn and go on with my life.” 【charisma Check (DC 5)】",
			"dc": 5,
			"check": "charisma"
		  },
		  {
			"text": "Option C: Ask her in return, “What about you? What would you want to change?” 【Charisma Check (DC 6)】",
			"dc": 6,
			"check": "charisma"
		  }
		]
	  },
	  { "action": "hide_talk_ui" }
	]
  }
]
