[
  {
	"branch": "C_success",
	"event": [
	  { "action": "spawn_character", "target": "Monster1", "pos": [-450, 0] },
	  { "action": "spawn_character", "target": "Alicia", "pos": [450, 0] },
	  { "action": "set_background", "target": "forest_path" },
	  { "action": "show_talk_ui" }
	],
	"text": "The beast lets out a low growl, the rocky armor along its limbs gleaming with a cold sheen. Its breath is heavy and scorching, as though it could crush the entire forest under its weight."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "I force myself to stay calm. Instead of moving recklessly, I watch it carefully. It moves fast despite its weight—but each time it lands, its right foreleg hesitates for just a fraction of a second."
  },
  {
	"text": "In that instant, I understand—that’s the weakness."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Alicia! Its right leg—there’s a crack!” I shout."
  },
  {
	"event": { "action": "shake", "target": "Monster1" },
	"text": "She reacts immediately, pivoting in one fluid motion. Like a streak of silver, she drives her blade straight into the fracture. With a dull impact, the beast freezes, then collapses and dissolves into a wisp of green smoke."
  },
  {
	"event": [
	  { "action": "remove_character", "target": "Monster1" }
	],
	"text": "I exhale deeply, my legs still trembling. Alicia slides her sword back into its sheath and scans the ground to ensure the creature is truly gone before turning back to me."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“That shout just saved me a lot of trouble.” There’s a hint of a smile in her voice. “Sharp eyes.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“I… just got lucky.” I rub the back of my neck."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Luck doesn’t point out cracks in armor.” She chuckles softly. “Next time you notice something like that, tell me sooner.”"
  },
  {
	"text": "A breeze sweeps through the trees, carrying away the lingering smoke. Alicia’s gaze falls to the scorched earth, her expression turning more solemn."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“These creatures aren’t natural,” she says quietly. “They’re ‘Lingering Dreams’—traces left behind by the dead.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Lingering Dreams?” I frown."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Yes. In places where battles were fought and people died, their final emotions sink into the ground. Over time, they become things like this.”"
  },
  {
	"text": "She looks back at me, her voice gentler now. “You did well just now. Thank you.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "I smile sheepishly. “That’s because you taught me well.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She laughs lightly. “I never taught you that.”"
  },
  {
	"text": "She extends her hand, and I take it instinctively—her palm still warm from the afterglow of battle."
  },
  {
	"text": "“You’re surprisingly quick to get comfortable,” she teases. “Come on. The market’s just ahead.”"
  },
  {
	"text": "Alicia smiles again, the expression faint but bright—like sunlight slipping through leaves and settling quietly in the heart."
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.5" }]
  }
]
