[
  {
	"event": [
	  { "action": "set_background", "target": "underground_entrance" },
	  { "action": "spawn_character", "target": "Lucia", "pos": [-450, 0] },
	  { "action": "spawn_character", "target": "EnemyLeader", "pos": [450, 0] },
	  { "action": "show_talk_ui" }
	],
	"text": "The air froze. The chanting stopped, and several gazes converged from within the shadows—cold, silent, yet burning with a twisted fanaticism."
  },
  {
	"text": "I didn’t hesitate. My boots slammed against the snow, shards of ice scattering as firelight flashed across my blade. The robed figures clearly hadn’t expected me to charge straight in."
  },
  {
	"text": "The ritual’s glow still flickered. One of the sorcerers nearest to me raised his hand, chanting rapidly; the air twisted like tangled threads."
  },
  {
	"event": { "action": "shake", "target": "Player" },
	"text": "I tried to dodge but slipped on the loose stones—my swing missed. A burst of blue light exploded before my eyes."
  },
  {
	"event": { "action": "hp_lost", "amount": 15 },
	"text": "A searing pain ripped through my arm, as if branded by hot iron. I staggered back, choking down a groan as blood dripped from my sleeve onto the ground."
  },
  {
	"event": { "action": "show_name", "target": "Lucia" },
	"text": "“Hey! You’re bleeding!”"
  },
  {
	"text": "Lucia cried out, quickly raising her staff as a shimmering wall of light formed between us."
  },
  {
	"text": "The blue blast slammed into it, scattering sparks. Her face was flushed from the effort, jaw clenched as she braced against the backlash."
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Forget me—save her!”"
  },
  {
	"event": { "action": "show_name", "target": "EnemyLeader" },
	"text": "“The blood of mortals... is enough to awaken the core.”"
  },
  {
	"text": "A chill ran down my spine as I realized—the glowing sigils were spreading from where my blood had fallen, tracing back toward the pillars like veins of light devouring life."
  },
  {
	"event": { "action": "show_name", "target": "Lucia" },
	"text": "“No—you won’t!”"
  },
  {
	"text": "Her voice was nearly drowned out by the roar around us. She lifted her staff, symbols flaring bright as daylight."
  },
  {
	"text": "Lucia charged forward; a sphere of light burst from her staff, blasting a nearby cultist off his feet."
  },
  {
	"text": "I forced myself up, slashing through the last binding rune around Alicia. In that instant, the ritual’s energy recoiled violently."
  },
  {
	"event": { "action": "shake", "target": "Player" },
	"text": "A shockwave hit me square in the chest, flinging me against the wall. My vision spun, ears ringing until all sound vanished into a dull hum."
  },
  {
	"text": "Through the haze, I saw Lucia kneeling on the ground, panting. Alicia’s limp body fell from midair, caught just in time by her arms."
  },
  {
	"text": "The light faded. The air stank of burnt blood and ozone."
  },
  {
	"event": { "action": "show_name", "target": "EnemyLeader" },
	"text": "“Interferers... you’ve sealed your fate.”"
  },
  {
	"event": [{ "action": "remove_character", "target": "EnemyLeader" }],
	"text": "The cult leader’s voice was icy and sharp before his figure vanished into a ripple of warped light."
  },
  {
	"text": "The remaining cultists scattered as the collapsing array swallowed them whole."
  },
  {
	"event": [
	  { "action": "spawn_character", "target": "Alicia", "pos": [450, 0] },
	  { "action": "show_name", "target": "Alicia" }
	],
	"text": "“Are you alright?!”"
  },
  {
	"text": "Alicia could barely stand, leaning on Lucia as they made their way toward me step by step."
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Don’t move.”"
  },
  {
	"text": "Her weak voice reached me as she drew glowing symbols in the air. A faint warmth spread through my wound, dulling the pain though the bleeding hadn’t stopped."
  },
  {
	"text": "“It’s a temporary seal,” she said, breath unsteady. “You’ll need real rest.”"
  },
  {
	"text": "I managed a strained smile. “Guess you and Lucia saved me again.”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“Your blood... part of it was absorbed into the array. You may have been pulled into its residual circuit.”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“What does that mean?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“For now, nothing. But if you get near another ritual like this... it might react.”"
  },
  {
	"text": "Her hand rested on mine, cold against my skin. “Promise me—don’t push yourself like that again.”"
  },
  {
	"text": "I froze. Her fingers tightened ever so slightly—gentle, but impossible to ignore."
  },
  {
	"event": [{ "action": "set_background", "target": "Street" }],
	"text": "We slowly emerged from the tunnel. The night wind cut like a blade, and the distant inn lights shimmered faintly through the snow."
  },
  {
	"event": { "action": "show_name", "target": "Lucia" },
	"text": "“Will they come back?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "“They will.”"
  },
  {
	"text": "Alicia’s voice was soft and weary. “But we’ll be faster.”"
  },
  {
	"text": "Snow crunched beneath our boots. The wind tangled her hair, carrying away the last traces of the ritual’s scent."
  },
  {
	"text": "I looked down at my bandaged arm, an uneasy chill creeping through me. Deep beneath the skin, the faint blue glow still pulsed like a heartbeat."
  },
  {
	"event": [{ "action": "change_scene", "target": "scene1.7" }]
  }
]
