[
  {
	"event": [
	  { "action": "hide_talk_ui" },
	  { "action": "set_background", "target": "tavern" },
	  { "action": "unlock", "target": "2_0" },
	  { "action": "chapter_change", "target": "2" }
	]
  },
  {
	"event": { "action": "show_talk_ui" },
	"text": "Morning mist slides down from the distant hills, drifting along the stone streets into the heart of town. Firelight flickers against the glass. Outside, the snow hasn’t stopped; the sky is gray like old iron."
  },
  { "text": "The tavern smells damp, the air still tinged with last night’s lingering smoke. I stand behind the counter polishing a cup, my knuckles numb from the cold." },
  { "text": "This is the most ordinary moment of the day—before travelers arrive, when only the echo of glass and my own breathing fill the room." },
  { "text": "But today is different." },

  {
	"text": "The door is kicked open. A rush of alcohol-laced wind bursts inside, snowflakes forced in and scattered across the floor.",
	"event": [
	  { "action": "spawn_character", "target": "Junker", "pos": [450, 0] },
	  { "action": "show_name", "target": "Junker" }
	]
  },
  { "text": "“Drink! Damn it, another bottle!” he roars as he storms in, eyes bloodshot, leather armor cracked, dried blood still clinging to the corner of his mouth." },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "“Drinking this early? The town guards will be here soon. You’re in no shape—go home and rest.”"
  },
  {
	"event": [
	  { "action": "show_name", "target": "Junker" },
	  { "action": "shake", "target": "Junker" }
	],
	"text": "“You telling me what to do?!”"
  },
  { "event": { "action": "hide_name" }, "text": "He grabs my collar, yanking so hard I’m nearly pulled over the counter." },
  {
	"text": "His fist crashes into me. My vision jolts; I taste blood along my gums. A few patrons retreat into the corner. Not one steps forward.",
	"event": [
	  { "action": "hp_lost", "amount": 10 },
	  { "action": "shake", "target": "Player" }
	]
  },
  { "text": "Then footsteps sound at the door." },
  { "text": "Not hurried—slow, steady. Like someone walking a road they’ve taken countless times before." },

  {
	"event": [
	  { "action": "spawn_character", "target": "Alicia", "pos": [-450, 0] },
	  { "action": "show_name", "target": "Alicia" }
	],
	"text": "A woman in a silver-white cloak steps inside. Frost still clings to her armor, her silver hair catching the cold light of morning."
  },
  { "text": "She sweeps a glance across the tavern, her gaze flat—as if looking at a painting she’s long grown tired of." },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“A pot of hot water.”"
  },
  { "text": "Her tone doesn’t rise or fall, as though the chaos before her is nothing but background noise." },

  {
	"event": [
	  { "action": "show_name", "target": "Junker" },
	  { "action": "shake", "target": "Junker" }
	],
	"text": "The drunk sneers at her. “What, another spectator?”"
  },
  {
	"event": { "action": "show_name", "target": "Player" },
	"text": "I cough up blood and manage to speak. “...Aren’t you going to do something?”"
  },
  {
	"event": { "action": "show_name", "target": "Alicia" },
	"text": "She lifts her eyes to me. There’s no malice in them—no pity either."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“I’ve stepped in many times before.”"
  },
  { "text": "The drunk looks ready to keep causing trouble, but his gaze lingers half a second on the deeply cracked sword at her waist. Not fear—calculation." },
  { "text": "He clicks his tongue, suddenly shifting tone like a market haggler." },
  {
	"event": [{ "action": "show_name", "target": "Junker" }],
	"text": "He jerks his chin at me. “You compensate me—fill my flask and I’ll leave. Call it cooling me down.”"
  },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "I press a hand to my face, teeth aching. “You just assaulted someone—”"
  },
  {
	"event": [{ "action": "show_name", "target": "Junker" }],
	"text": "“Shut it!” He slams the empty bottle on the counter. “Fill it, or I’ll tear this place apart for firewood.”"
  },

  { "event": { "action": "hide_name" }, "text": "The patrons shrink into the corner. Alicia sits quietly, stirring her hot water with one finger, not even raising her eyes. Her silence feels like a wall." },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "I take a deep breath, swallow my anger, and ladle ale into his filthy leather flask. The liquid splashes across my knuckles, freezing cold."
  },

  {
	"event": [
	  { "action": "show_name", "target": "Junker" },
	  { "action": "shake", "target": "Junker" }
	],
	"text": "He snatches the flask, weighing it in his hand, grinning. “That’s more like it.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Junker" }],
	"text": "He tilts it back for a long swig and exhales in satisfaction. “Good. Next time I show up, don’t waste my time.”"
  },

  { "event": { "action": "hide_name" }, "text": "He flicks a broken copper coin onto the counter. It lands with a sharp clink—not payment, more like charity." },

  {
	"event": [{ "action": "show_name", "target": "Junker" }],
	"text": "“I blocked your bad luck today.” He grins as he heads for the door. “You’re lucky I’m in a good mood.”"
  },
  { "event": { "action": "hide_name" }, "text": "He shoulders the door open, cold wind and snow rushing inside. As he steps out, he glances back at Alicia, as if confirming he’s ‘won.’" },
  {
	"event": [{ "action": "show_name", "target": "Junker" }],
	"text": "“Pretty thing, keep the hot water for yourself.”"
  },

  {
	"text": "I look down and see the broken copper coin roll to the base of the counter. Tiny runic engravings line its edge. It doesn’t look like loose change—more like some kind of charm."
  },
  {
	"event": [
	  { "action": "add_item", "target": "LuckyCoin", "amount": 1 }
	],
	"text": "When I pick it up, warmth pulses against my fingertips, as if some fragment of fortune has been pressed into my palm."
  },
  {
	"event": { "action": "remove_character", "target": "Junker" },
	"text": "He laughs loudly as he leaves, his boots crunching in the snow until the wind swallows the sound."
  },

  { "text": "Silence returns to the tavern, broken only by the crackle of the hearth. I cover my face; my palms are warm, but I feel cold." },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "My voice is hoarse. “...Do you know me?”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "She doesn’t answer. She only says lightly, “The key’s under the rug, right? I’ll be staying tonight.”"
  },
  { "event": { "action": "hide_name" }, "text": "She turns and heads upstairs. At the bend, her cloak shifts, revealing the cracked sword at her side—looking as though it might break at any moment." },

  { "text": "I stand there, stunned. Only regulars know about the spare key hidden under the rug." },

  {
	"event": [
	  {
		"action": "show_option_ui",
		"options": [
		  { "text": "Follow her upstairs and demand, “Who are you really?” 【Insight Check (DC 6)】", "dc": 6, "check": "intelligence" },
		  { "text": "Swallow the humiliation and tend to your wounds and the tavern first 【No Check (DC 0)】", "dc": 0, "check": "dexterity" }
		]
	  },
	  { "action": "hide_talk_ui" }
	]
  }
]
