[
  {
	"event": [
	  { "action": "set_background", "target": "town_snow_street" },
	  { "action": "unlock", "target": "2_6_1" },
	  { "action": "show_talk_ui" }
	],
	"text": "Her order is clear: go back."
  },
  {
	"text": "I stand in the snow outside the north gate, my throat tight. She doesn’t raise her voice, doesn’t explain—she just nudges me a step back from the edge of the formation, like pulling out a nail that shouldn’t be here."
  },
  {
	"text": "I don’t argue. As I turn away, commands ring out behind me one after another, shields crashing together, making even the snow tremble."
  },
  {
	"text": "The walk back feels longer than the walk here. Streets begin to close off; guards herd people indoors, merchants hurriedly pack up their stalls, and the square is left with only wind and abandoned tables."
  },
  {
	"text": "Someone whispers her name, then immediately falls silent—as if leaving the sentence unfinished might keep the ending from happening."
  },
  {
	"event": [
	  { "action": "set_background", "target": "tavern_night" }
	],
	"text": "I return to the inn, slide the bolt into place, and push a table against the door."
  },
  {
	"text": "The firelight flickers, the cups are neatly arranged, but the room echoes with emptiness—like it’s missing a set of footsteps that should have arrived."
  },
  {
	"text": "I force myself to move: add wood to the fire, wipe the counter, set my short sword within easy reach. I finish once, then do it again."
  },
  {
	"text": "Later in the night, sounds drift through the fog from the north: something like a horn—something like stone collapsing. Then comes a long silence, so deep I can hear my own breath scraping in my throat."
  },
  {
	"text": "I stand behind the counter, my knuckles white. Only then do I realize—I’ve been waiting for the possibility that she would come back."
  },
  {
	"text": "Footsteps pass outside the door, hurried and uneven. Low voices murmur, as if afraid of disturbing something."
  },
  {
	"text": "I don’t open the door right away. I press close to it, catching fragments of conversation through the wood:"
  },
  {
	"text": "“North gate… held.”"
  },
  {
	"text": "“Not everyone made it back.”"
  },
  {
	"text": "“Don’t ask… just go home.”"
  },
  {
	"text": "I slowly loosen my grip on the bolt, then slowly draw my hand back. The room is warm, but a chill creeps up my spine inch by inch."
  },
  {
	"text": "That night, no one knocks on my door, and no one finishes the story. But the whole town seems to accept one thing: the sun will rise tomorrow—and she will not walk back down this street."
  },
  {
	"event": [
	  { "action": "change_scene", "target": "scene3.0" }
	]
  }
]
