[
  {
	"event": [
	  { "action": "set_background", "target": "town_snow_street" },
	  { "action": "unlock", "target": "2_6_2" },
	  { "action": "show_talk_ui" }
	],
	"text": "I stay, but don’t push forward."
  },
  {
	"text": "I don’t touch her battlefield—I only do the work she called “not getting in the way”: moving supplies, passing medicine, running errands, dragging the fallen to the rear."
  },
  {
	"text": "The snow falls heavier. Mud and ice churn together underfoot, every step like sinking into freezing water. But the people at the north gate don’t stop."
  },
  {
	"text": "The moment the medical kit opens, the sharp scent of disinfectant cuts through the blood in the air. Lucia kneels inside a makeshift shelter, fingers red with cold, yet she wraps each bandage tight and steady."
  },
  {
	"event": [{ "action": "spawn_character", "target": "Lucia", "pos": [450, 0] }],
	"text": "She looks up and sees me. Relief flickers in her eyes—then tightens again at once."
  },
  {
	"event": [{ "action": "show_name", "target": "Lucia" }],
	"text": "“So you really stayed…”"
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“I’m just carrying things. I’m not stepping forward.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Lucia" }],
	"text": "“Then take these to the shield line on the left.”"
  },
  {
	"text": "She shoves a pouch of clotting powder into my arms, quick—like if she slowed down, she’d start thinking too much."
  },
  {
	"text": "I run past the supply piles and see a different kind of struggle: someone bracing a crate with their shoulder, someone retieing ropes stiff with frost, someone shielding a wounded man with a torn blanket."
  },
  {
	"text": "No one shouts about heroes. Just short commands: “Here.” “Again.” “Hurry.”"
  },
  {
	"event": [{ "action": "spawn_character", "target": "Alicia", "pos": [-450, 0] }],
	"text": "From a distance, I see Alicia standing on the stone steps. She makes no wasted motion, yet the entire defense line tightens under her hands."
  },
  {
	"text": "She points to the left flank—shields shift at once. She raises a hand—the archers on the right reposition. Not a word wasted."
  },
  {
	"text": "That fluency isn’t ease—it’s fear pressed thin. So thin it can’t be seen."
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "I hand over the medicine and can’t help calling out, “Alicia!”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "Her gaze lands on me, then quickly drops to the pouch in my hand, then to the ground at my feet—confirming I haven’t crossed the line."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Good.”"
  },
  {
	"event": [
	  { "action": "add_item", "target": "keeper_badge" }
	],
	"text": "She steps closer and pulls an old bronze badge from inside her cloak, pressing it into my hand."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Keep it. Guarding the fire is harder than wielding a sword.”"
  },
  {
	"event": [{ "action": "hide_name" }],
	"text": "The badge is cold at first, then slowly warms in my palm."
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“I’m not in the way.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“You’re already in my way—here.”"
  },
  {
	"text": "She says it plainly, briefly. Like she’s holding something down and will only let it surface this far."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Go back.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“It hasn’t even started—”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“It will.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“I need you to keep the inn secure. Keep the fire burning. Bolt the door. If Lucia comes back, give her hot water.”"
  },
  {
	"text": "When she says “hot water,” her voice softens just slightly—as if she finally allows herself to admit someone might be afraid, cold, or unable to hold on."
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“Will you come back?”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "She doesn’t hesitate."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“I’ll try.”"
  },
  {
	"text": "Not a promise—just the fullest honesty she can offer."
  },
  {
	"text": "She gestures me back again, placing me in the “safe position.” Then she turns and resumes directing the line, her silhouette clean and taut like a drawn bow."
  },
  {
	"text": "I stand there, suddenly aware that my palms are slick with sweat. The wind cuts across them, cold and sharp."
  },
  {
	"text": "I leave the north gate as she told me to. Looking back along the way, the defensive line grows into a thin, dark thread in the snow-fog."
  },
  {
	"text": "When I reach the inn, the fire is still burning. But I can’t sit still."
  },
  {
	"text": "That night, I don’t sleep. Every time the wind rises, I think it’s begun at the north gate."
  },
  {
	"event": [
	  { "action": "change_scene", "target": "scene3.0" }
	]
  }
]
