[
  {
	"event": [
	  { "action": "hide_talk_ui" },
	  { "action": "set_background", "target": "tavern_upstairs" },
	  { "action": "show_talk_ui" }
	]
  },

  {
	"text": "I chased upstairs. The corridor was eerily quiet. Her door wasn’t locked, as if she had known I would come."
  },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "\"…Who are you, really? And why didn’t you step in just now?\""
  },

  {
	"event": { "action": "hide_name" },
	"text": "A faint sigh came from inside the room, like she was letting something heavy slip from her chest."
  },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "\"Who I am isn’t something you need to know right now.\""
  },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "\"Then at least tell me this: why did you just watch while I got beaten? I saw your sword. Aren’t you a swordsman? Where was your responsibility?\""
  },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "She was silent for two seconds, then said plainly, \"Because I’m too tired.\""
  },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "\"It’s not that you weren’t worth saving. I just couldn’t hold on.\""
  },

  {
	"event": { "action": "hide_name" },
	"text": "The door opened slightly. She stood behind it, her face pale, dark circles heavy beneath her eyes as if she hadn’t slept for days. Her grip on the sword, however, remained steady."
  },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "\"I’ve handled things like this before. Many times.\""
  },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "\"But today, I don’t have the strength. If you want an explanation, this is it: I’m so exhausted that even lifting my hand hurts.\""
  },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "\"…So you’re asking me to understand you?\""
  },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "\"Yes.\" She nodded once. \"You can blame me if you want, but don’t be reckless. If you had gone up against him tonight, you would have died.\""
  },

  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "\"How do you know I would have died?\""
  },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "\"I’ve seen it,\" she said calmly. \"That’s why I didn’t bother pretending this was our ‘first meeting.’\""
  },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "\"Listen. Don’t go out. Tonight is dangerous.\""
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "\"You don’t have to understand the reason. Just do as I say.\""
  },

  {
	"event": { "action": "hide_name" },
	"text": "Her tone wasn’t harsh—if anything, it was almost gentle, like she was leaving a way out for someone who didn’t know any better."
  },

  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "\"Go downstairs,\" she added. \"Apply some medicine. Don’t push yourself.\""
  },

  {
	"event": { "action": "hide_name" },
	"text": "The door closed slowly—not to drive me away, but because she truly didn’t have the strength left to keep talking."
  },

  {
	"text": "I stood in the corridor, realizing for the first time that her earlier coldness might not have been indifference, but exhaustion stretched to its limit."
  },

  {
	"event": [
	  { "action": "hide_talk_ui" },
	  { "action": "change_scene", "target": "scene2.2" }
	]
  }
]
