[
  {
	"event": [
	  { "action": "set_background", "target": "town_snow_street" },
	  { "action": "unlock", "target": "2_6" },
	  { "action": "show_talk_ui" }
	],
	"text": "The morning of the third day. The snow hasn’t fully stopped, yet the streets are busier than usual."
  },
  {
	"text": "I’ve just opened the door for air when I see several squads of guards assembling at the intersection, running north. People are knocking on doors, shouting for shops to send planks, ropes, and oil lamps to the north gate."
  },
  {
	"text": "If this were any other day, I would shut the door and pretend it had nothing to do with me."
  },
  {
	"text": "But I can’t stop thinking about what Alicia said last night: “I’ll need it tomorrow.”"
  },
  {
	"text": "She wasn’t speaking casually. She was planning."
  },
  {
	"text": "I grab my coat, tuck my short sword at my waist, lock the door, and follow the flow of people north."
  },
  {
	"text": "The farther north I go, the fewer civilians remain, and the louder the sounds gather: metal clashing, shouted orders, horses snorting."
  },
  {
	"text": "A defensive line has been cleared outside the north gate. Stakes and shield walls are half-built. Mages and guards split into squads, positioned quickly as if guided by an invisible hand."
  },
  {
	"event": [
	  { "action": "set_background", "target": "north_gate" },
	  { "action": "spawn_character", "target": "Alicia", "pos": [-450, 0] },
	  { "action": "show_name", "target": "Alicia" }
	],
	"text": "Alicia stands at a makeshift command point, ash from the night still clinging to her cloak. She wears no extra armor, yet every motion is precise, like she’s memorized every step."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Shieldbearers, two rows. First row against the stakes, second row half a step back—leave room for the mages to move.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Don’t hang the oil lamps on the gate. Hang them to the sides. If fire starts, don’t let the frame burn first.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Archers, one command only: when I raise my hand, you fire; when I lower it, you stop. No improvising.”"
  },
  {
	"text": "The guards don’t question her. It’s as if she’s already convinced them long ago. On the other side, Lucia counts talismans and potion vials, dark circles under her eyes, hands never stopping."
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "I step closer. “How do you arrange them so smoothly?”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "She looks at me, as if assessing whether I’m going to be a problem."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Because the unprepared die faster.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“You said last night you’d need it today—you’re planning to hold the north gate?”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Until nightfall.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“I’ll draw out the worst one and deal with it. The others just need to hold the line. Keep the streets from breaking first.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Player" }],
	"text": "“Sounds like you already knew this would happen.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "She doesn’t deny it. She simply pulls her cloak tighter over her shoulders, as if pulling her emotions back with it."
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“You being here won’t help.”"
  },
  {
	"event": [{ "action": "show_name", "target": "Alicia" }],
	"text": "“Go back to the inn. Close the door. Don’t get yourself hurt again today.”"
  },
  {
	"text": "She says it plainly—not a request, more like reducing variables."
  },
  {
	"text": "I almost argue, but then I notice the small splits along her knuckles—like she held a sword too long last night."
  },
  {
	"text": "Lucia glances up at me. Her eyes say the same thing: don’t make this harder. But there’s also relief there—at least I’m still standing."
  },
  {
	"event": [
	  {
		"action": "show_option_ui",
		"options": [
		  { "text": "Option A: Listen to her, turn away from the north gate, and return to the inn to wait for news [No Check (DC 0)]", "dc": 0, "check": "dexterity" },
		  { "text": "Option B: Insist on staying to do ‘non-disruptive’ work (moving supplies / delivering medicine / running errands) [Constitution (DC 12)]", "dc": 12, "check": "constitution" }
		]
	  },
	  { "action": "hide_talk_ui" }
	]
  }
]
